package com.crud.jo.demorice;

import android.app.ProgressDialog;
import android.content.Intent;
import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.RecyclerView;
import android.support.v7.widget.Toolbar;
import android.util.Log;
import android.view.View;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.Spinner;

import com.crud.jo.demorice.model.Analysis;

import java.util.ArrayList;

public class AnalysisArea extends AppCompatActivity {

    private String TAG = Main.class.getSimpleName();
    private ProgressDialog pDialog;
    private RecyclerView lv;
    private Button calculat_rice;
    private Spinner mySpinnerrice;
    private Spinner mySpinnerarea;
    private Spinner mySpinnertambon;
    private Spinner mySpinnerwater_area;

    private int[] rice_picture = {//ใส่รูปภาพที่จะไปแสดง
            //rice
            R.drawable.rice0001,//0
            R.drawable.rice0070,//1
            R.drawable.rice0109,//2
            R.drawable.rice0168,//3
            R.drawable.rice0227,//4
            R.drawable.rice0286,//5
            R.drawable.rice0345,//6
            R.drawable.rice0463,//7
            R.drawable.rice0522,//8
            R.drawable.rice0577,//9
            //soil
            R.drawable.soil0001,//10
            //weed
            R.drawable.weed0070,//11
            R.drawable.weed0168,//12
            R.drawable.weed0286,//13
            R.drawable.weed0463,//14
            R.drawable.weed0523,//15
            //fertilizer
            R.drawable.fer0001,//16
            R.drawable.fer0002,//17
            R.drawable.fer0004,//18
            R.drawable.fer0006l,//19
            R.drawable.fer0007,//20
            R.drawable.fer0008,//21
            R.drawable.fer0009,//22
            R.drawable.fer013,//23
            R.drawable.fer0146,//24
            R.drawable.fer0149,//25
            R.drawable.fer0237,//26
    };


    // URL to get contacts JSON
    private static String url = "http://www.projectricearea.com/android_view_api/analysis_show.php";
    ArrayList<Analysis> contactList;


    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.content_analysis);

        mySpinnerrice = (Spinner) findViewById(R.id.spinnerrice);
        mySpinnerarea = (Spinner) findViewById(R.id.spinnearea);
        mySpinnertambon = (Spinner) findViewById(R.id.spinnetambon);
        mySpinnerwater_area = (Spinner) findViewById(R.id.spinnerwater_area);

        ArrayAdapter<String> myAdapter = new ArrayAdapter<String>(AnalysisArea.this,
                android.R.layout.simple_spinner_item, getResources().getStringArray(R.array.spinnerrice));

        myAdapter.setDropDownViewResource(android.R.layout.simple_dropdown_item_1line);
        mySpinnerrice.setAdapter(myAdapter);


        ArrayAdapter<String> myAdapter2 = new ArrayAdapter<String>(AnalysisArea.this,
                android.R.layout.simple_spinner_item, getResources().getStringArray(R.array.spinnearea));

        myAdapter2.setDropDownViewResource(android.R.layout.simple_dropdown_item_1line);
        mySpinnerarea.setAdapter(myAdapter2);

        ArrayAdapter<String> myAdapter3 = new ArrayAdapter<String>(AnalysisArea.this,
                android.R.layout.simple_spinner_item, getResources().getStringArray(R.array.spinnetambon));

        myAdapter3.setDropDownViewResource(android.R.layout.simple_dropdown_item_1line);
        mySpinnertambon.setAdapter(myAdapter3);

        ArrayAdapter<String> myAdapter4 = new ArrayAdapter<String>(AnalysisArea.this,
                android.R.layout.simple_spinner_item, getResources().getStringArray(R.array.spinnerwater_area));

        myAdapter4.setDropDownViewResource(android.R.layout.simple_dropdown_item_1line);
        mySpinnerwater_area.setAdapter(myAdapter4);

        Toolbar toolbar = (Toolbar) findViewById(R.id.toolbar);
        setSupportActionBar(toolbar);
        toolbar.setNavigationOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent i = new Intent(getApplicationContext(),
                        Users_Main.class);
                startActivity(i);
                finish();
            }
        });


        //for calculate rice
        calculat_rice = (Button) findViewById(R.id.cal_button);

        calculat_rice.setOnClickListener(new View.OnClickListener() {

            @Override
            public void onClick(View view) {
                String rice_type_layout = mySpinnerrice.getSelectedItem().toString().trim();
                String rice_aumper = mySpinnerarea.getSelectedItem().toString().trim();
                String rice_tambon = mySpinnertambon.getSelectedItem().toString().trim();
                String rice_water_area = mySpinnerwater_area.getSelectedItem().toString().trim();

                Log.d("TAGE" , ""+rice_type_layout);
                Log.d("TAGE" , ""+rice_aumper);
                Log.d("TAGE" , ""+rice_tambon);
                Log.d("TAGE" , ""+rice_water_area);


                if(rice_type_layout != null && rice_aumper != null && rice_tambon != null && rice_water_area != null) {
//เงื่อนไขที่ใช้เช็ต data
                    if(rice_type_layout.equals("สุพรรณบุรี60") && rice_aumper.equals("อำเภอคลองหลวง") && rice_tambon.equals("คลองหนึ่ง") && rice_water_area.equals("ได้รับ")) {
                        final String rice_type = "สุพรรณ60";
                        final String weather_napee = "ฤดูฝน พฤษภาคม - ตุลาคม อุณหภูมิเฉลี่ย 29.52 ปริมาณน้ำฝนเฉลี่ย 293.87";
                        final String weather_napung = "ฤดูร้อน กุมภาพันธ์ - พฤษภาคม อุณหภูมิเฉลี่ย 30.65 ปริมาณน้ำฝนเฉลี่ย 75.2";
                        final String Chemical_fertilizer = "การใส่ปุ๋ยมีควรแบ่งใส่ 2 ครั้ง ดังนี้ การใส่ปุ๋ยรั้งที่ 1 - ใช้ปุ๋ยสูตร 16-20-0 สําหรับนาดินเหนียว หากเป็นนาดินทราย ใช้สูตร 16-16-8 จํานวนไร่ละ 25-30 กิโลกรัม โดยหว่านก่อนปักดำข้าว 1 วัน หรือภายใน 10 วัน หลังจากปักดำข้าวสําหรับนาดํา ถ้าเป็นนาหว่านให้หว่านปุ๋ยหลังจากข้าวงอกแล้ว 20-25 วัน การใส่ปุ๋ยครั้งที่ 2 - ใช้ปุ๋ยสูตร 46-0-0 จํานวนไร่ละ 10 กิโลกรัม (หรือปุ๋ยสูตร 26-0-0 จํานวนไร่ละ 20 กิโลกรัม) โดยหว่านระยะข้าวรวงอ่อน คือก่อนเก็บเกี่ยว 60 วัน หรือหลังจากปักดําประมาณ 35-45 วัน สําหรับนาดํา ถ้าเป็นนาหว่านให้หว่านหลังจากหว่านปุ๋ยครั้งแรกประมาณ 35-45 วัน ปุ๋ยเคมีสูตร 9-24-24 คุณสมบัติปุ๋ยเคมีสูตร 9-24-24 เป็นปุ๋ยเคมีชนิดเม็ด ประกอบด้วยปริมาณธาตุอาหารหลัก ดังนี้ 1.ไนโตรเจนทั้งหมด(N) 9 % เร่งการเจริญเติบโต  ใส่แล้วพืชจะเขียวเข็ม  โตเร็ว   2.ฟอสเฟตที่เป็นประโยชน์(P2O5) 24 % การสร้างแป้ง-น้ำตาล  ให้ต้นพืช  เพื่อสะสมการออกดอก 3.โพแทชที่ละลายน้า(K2O) 24 %   ช่วยให้ผลผลิต  มีน้ำหนักเพิ่มขึ้น  สร้างความหวาน        ปุ๋ยเคมีสูตร 9-24-24  เป็นปุ๋ยเร่งดอกเร่งผล ทำให้ออกดอกมาก ดอกสวยงามสีสด  ผลใหญ่ รสชาดดี          วิธีใช้ ปุ๋ยสูตร 9-24-24         การใส่ปุ๋ยสูตร 9-24-24 จะทำให้พืชสร้างตาดอก ทำให้ดอกดก ดอกใหญ่ สีสวย  การใส่ปุ๋ยสูตร 9-24-24  ใส่ในอัตราส่วน   1-2 ช้อนชา / ต้น ทุก 15 วัน (พืชที่โตเต็มที่และพร้อมให้ดอกและผล)  ในพืชผักเช่น พริก หอม กระเทียม มันฝรั่ง มะเขือ ขิง ควรหว่านให้ทั่วแปลงในอัตรา 40-60 กิโลกรัมต่อไร่";
                        final String Bio_fertilizer = "1 ไถ่พรวน หว่านปุ๋ยชีวภาพ 100 ก.ก. (ต่อ 1 ไร่) ให้ทั่ว จากนั้นนำน้ำหมักชีวภาพที่ได้จากน้ำหมักพืช 2 แก้ว กากน้ำตาล 2 แก้ว ในน้ำ 200 ลิตร (1 ถังแดง) ต่อพื้นที่ 1 ไร่ ฉีดพ่นให้ทั่วแล้วไถพรวน ทิ้งไว้ 15 วัน เพื่อให้จุลินทรีย์ในน้ำหมักพืชทำการย่อยสลายวัชพืชและเร่งการงอกของเมล็ดข้าว เมื่อไถพรวนแล้ว 15 วัน ให้ฉีดพ่นน้ำผสมน้ำหมักพืช และกากน้ำตาล ในอัตราส่วนเท่าเดิมอีกครั้งหนึ่ง แล้วไถกลบเพื่อทำลายวัชพืช ให้เป็นปุ๋ยพืชสด ทิ้งไว้อีก 15 วัน แล้วจึงไถคราดเพื่อดำนาต่อไป";
                        final String soil_type = "ดินเหนียวจัด";
                        final String adjust_soil = "1. ดินกรดจัดน้อย (ชั้น P-IIa) เหมาะสมในการทำนา ความเป็นกรดของดินเป็นอุปสรรคบ้างเล็กน้อย เป็นดินเหนียว หน้าดินลึก การระบายน้ำเลว ดินบนมีค่า pHต่ำกว่า 5.5 ความอุดมสมบูรณ์ปานกลาง ข้าวมีการตอบสนองต่อปุ๋ยน้อย ได้ผลผลิตประมาณ 250-350 กิโลกรัมต่อไร่ ดินชั้นนี้มีพื้นที่ประมาณ 3,500,000 ไร่ มี ประมาณ 3 แสนไร่ หรือ ร้อยละ 60 อยู่ในภาคกลาง ได้แก่ ดินชุดอยุธยา มหาโพธิ์ อยุธยา/มหาโพธิ์ เสนา บางน้ำเปรี้ยว ฉะเชิงเทรา และ ท่าขวาง โดยดินชุดเสนา เป็นดินชุดที่มีพื้นที่มากที่สุด ประมาณ ร้อยละ 50 ของชั้น และ ร้อยละ 20 อยู่ในภาคกลาง";
                        final String weed_type = " ";
                        final String weed_Removal = " ";
                        final String dayrice_napung = "ประมาณ 120 - 122 วัน";
                        final String ricedisease_name = "1 โรคใบขีดสีน้ำตาล";
                        final String ricedisease_Removal = "อาการ ลักษณะแผลที่ใบมีสีน้ำตาลเป็นขีด ๆ ขนานไปกับเส้นใบข้าว มักพบในระยะข้าวแตกกอ แผลไม่กว้าง ตรงกลางเล็กและไม่มีรอยช้ำที่แผล ต่อมาแผลจะขยายมาติดกัน แผลจะมีมากตามใบล่างและปลายใบ ใบที่เป็นโรคจะแห้งตายจากปลายใบก่อน ต้นข้าวที่เป็นโรครุนแรงจะมีแผลสีน้ำตาลที่ข้อต่อใบได้เช่นกัน เชื้อนี้สามารถเข้าทำลายคอรวง ทำให้คอรวงเน่าและหักพับได้ การป้องกันกำจัด ใช้ปุ๋ยโปแตสเซียมคลอไรด์ (0-0-60) อัตรา 5-10 กิโลกรัมต่อไร่ สามารถช่วยลดความรุนแรงของโรคได้ ถ้าพบโรคระบาดของโรครุนแรงในระยะแตกกอ ให้ฉีดพ่นด้วยสารป้องกันกำจัดเชื้อรา เช่น คาร์เบ็นดาซิม เนื่องจากเชื้อสาเหตุทำให้เกิดโรคเมล็ดด่าง";
                        final String rice_method_one = "การหว่านน้ำตม เป็นการหว่านเมล็ดพันธุ์ข้าวในพื้นที่ที่มีน้ำหรือในเขตชลประทาน ซึ่งจะต้องมีการเตรียมพื้นที่ทำนาให้เป็นตมเสียก่อนที่จะทำการหว่านเมล็ดพันธุ์ข้าวที่เพาะให้งอกเล็กน้อยลงไป โดยมีการใช้เครื่องจักรกลเกษตรในแต่ละขั้นตอนการปลูกข้าว ดังนี้ 1. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 2. เปิดหน้าดิน ไถหัวหมู, ไถจาน, โรตารี 3. ย่อยดิน ขลุบ, คราด 4. ทำเทือก แผ่นปรับระดับดิน, เครื่องชักร่องน้ำ 5. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 6. หว่านเมล็ดข้าว เครื่องหว่านเมล็ดแบบสะพายหลัง, เครื่องหว่านเมล็ดแบบจานเหวี่ยง 7. หว่านปุ๋ย เครื่องหว่านปุ๋ยแบบสะพายหลัง, เครื่องหว่านปุ๋ยแบบติดเครื่องต้นกำลัง 8. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 9. พ่นยา เครื่องพ่นยาแบบสะพายหลัง, เครื่องพ่นยาแบบติดเครื่องต้นกำลัง 10. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 11. ลดความชื่นข้าวเปลือก รถเกลี่ย/รถตักข้าว, เครื่องอบลดความชื้น 12. เก็บเกี่ยว เครื่องเก็บเกี่ยวนวด, เครื่องเกี่ยววางราย, เคียว 13. นวดข้าว เครื่องนวดข้าวแบบใช้แรงงานคน, เครื่องนวดข้าวแบบใช้เครื่องยนต์ 14. เก็บรักษา ไซโล, ฉางข้าว 15. ขนส่ง รถอีแต๊ก, รถอีแต๋น, รถยนต์ 4-10 ล้อ";
                        final String rice_method_two = "การทำนาแบบโยนกล้ามีอยู่ 4 ขั้นตอน ดังนี้ 1.ขั้นตอนการเตรียมเพาะกล้าพันธุ์ ซึ่งเตรียมได้ 2 แบบ คือ วิธีเตรียมถาดเพาะกล้าแบบแห้ง โดยย่อยดินแห้งให้ละเอียด เม็ดดินโตไม่เกิน 0.5 ซม. ดินนั้นต้องไม่มีเมล็ดข้าววัชพืช นำถาดพลาสติกมาวางกับพื้นที่ ที่เตรียมไว้ พื้นที่ต้องเสมอกัน โดยวางเป็นแถวตอน 2-4 แผ่น (แล้วแต่ความสะดวกในการปฏิบัติงาน) หว่านดินไปก่อนประมาณ 50-70% จากนั้นหว่านเมล็ดพันธุ์บริสุทธิ์ (แช่ 1 คืน หุ้ม 1 คืน หรือข้าวแห้ง) อัตราประมาณ 3-4 กก.ต่อ 50-60 ถาด (ต่อไร่) แล้วหว่านดินตามลงไปให้เต็มเสมอปากหลุมพอดี อย่าให้ดินล้นปากหลุมเพาะ เพราะจะทำให้รากข้าวพันกันเวลาโยนต้นกล้า มันจะไม่กระจายตัว การใช้แรงงานย่อยดินแห้งและเพาะข้าว 1 คน ต่อ 150-200 ถาดต่อ 1 วัน (หว่านได้ 2-3 ไร่) การให้น้ำระยะแรก ๆ ต้องให้ฝอยละเอียด ระวังอย่าให้เมล็ดข้าว กระเด็น หรือให้น้ำแบบท่วมพื้นแปลง เพราะน้ำจะซึมเข้าก้นถาดหลุมเอง ให้รักษาความชื้นจนกว่าข้าวงอก หากมีฝนตกให้หาวัสดุหรือกระสอบป่านเก่ามาคลุมจนกว่ารากจะงอก วิธีนี้สามารถเพาะเมล็ดในร่มและย้ายถาดไปที่ที่เตรียมไว้ พอข้าวกล้าอายุ 12-16 วัน สามารถนำไปโยนได้ทันที ความยาวต้นกล้าประมาณ 3-5 นิ้ว ซึ่งก็แล้วแต่ความอุดมสมบูรณ์ของวัสดุเพาะ ใช้พื้นที่เพาะกล้าประมาณ 12-15 ตารางเมตรต่อ 50-60 ถาด หว่านได้ 1 ไร่ วิธีเพาะกล้าแบบแห้งนี้ ได้คิดค้นวิธีหยอดเมล็ดพันธุ์ที่แม่นยำ สามารถควบคุมดินและเมล็ดพันธุ์ตามต้องการได้ เป็นอุปกรณ์ต้นแบบเพื่อนำไปพัฒนาต่อยอดได้ วิธีเตรียมถาดเพาะกล้าแบบเปียก โดยเลือกแปลงนาที่ไม่มีข้าววัชพืชและวัชพืชทั่วไประบาด มีการเตรียมแปลงคล้ายกับเพาะกล้านาดำ ลูบเทือกให้ดินสม่ำเสมอ นำถาดเพาะกล้าวางเป็นแถวคู่เอาหัวชนกัน วางเป็นแถวตอนความยาวแล้วแต่แปลงกล้า แต่ละคู่แถวห่างกันประมาณ 50 ซม.เพื่อให้สะดวกในการปฏิบัติงาน โดยนำดิน เลนระหว่างร่องทางเดินใส่บานถาดให้เต็ม ปรับให้เสมอปากหลุมถาด แต่อย่าให้ดินล้นปากหลุมเพาะ เพราะจะทำให้รากข้าวพันกันเวลาหว่านต้นกล้า จากนั้นหว่านเมล็ดพันธุ์บริสุทธิ์ (โดยแช่ 1 คืน หุ้ม 1 คืน หรือข้าวแห้ง) ด้วยอัตราประมาณ 3-4 กก./50-60 ถาด (ต่อไร่) ใช้แผ่นไม้คล้ายไม้บรรทัดกดหรือลูบเมล็ดพันธุ์ให้จมเลน โดยรักษาความชื้นตลอดไป หากมีฝนตกต้องหาวัสดุมาคลุมเพื่อกันเมล็ดข้าวกระเด็นออกจากถาดเพาะ พอกล้าอายุ 12-16 วัน นำไปโยนได้ทันที หรือความยาวต้นกล้าประมาณ 3-5 นิ้ว ใช้พื้นที่เพาะกล้าประมาณ 12-15 ตารางเมตร 50-60 ถาด โดยได้ 1 ไร่ ก่อนนำไปโยนควรหยุดให้น้ำต้นกล้า 1 วัน ภาพการเตรียมแปลงนา โดย นางสาวสุดารัตน์ แก้วบัวดี 2.ขั้นตอนการเตรียมแปลง ก่อน ทำนาให้พักแปลงนาให้แห้งอย่างน้อย 1 เดือน เพื่อให้ข้าววัชพืชพ้นระยะพักตัว หรือให้เมล็ดข้าววัชพืชที่ร่วงในนาก่อนนี่พร้อมที่จะงอกให้มากที่สุด ให้ขังน้ำในแปลง 1 คืน และปล่อยให้น้ำแห้งเองเพื่อล่อข้าววัชพืชให้งอกขึ้นมาเต็มที่ซึ่งไม่ควรพ่น สารเคมีกำจัด แต่ให้ไถกลบทุบเป็นปุ๋ยไปเลย... ควรล่อวัชพืชอย่างน้อย 1 ครั้งขึ้นไป ต่อจากนั้น ให้ไถเตรียมดินเหมือนนาดำ หรือนาหว่านน้ำตมทั่วไป แต่ปรับเทือกให้สม่ำเสมอมากที่สุด พอเช้าวันต่อมาให้โยนกล้าได้กรณีที่เป็นดินเหนียว แต่ถ้าเป็นดินร่วนปนทรายหรือดินทราย หลังปรับเทือกให้โยนต้นกล้าทันทีทันใด ภาพการโยนกล้า โดย นางสาวสุดารัตน์ แก้วบัวดี 3.ขั้นตอนการโยนต้นกล้า ขณะ ที่โยนต้นกล้าในแปลงควรมีน้ำขลุกขลิกเล็กน้อย วิธีโยน ให้เดินถอยหลังโยนกำมือละ 5-15 หลุม โดยตวัดหงายมือโยนต้นข้าวขึ้นสูงกว่าระดับศีรษะ ต้นกล้าจะกระจายตัวพุ่งลงตั้งตรงหรือเอนเล็กน้อย สำหรับถาดเพาะให้วางบนท่อนแขนครั้งละหลาย ๆ แผ่นแล้วแต่จะรับไหว หากเห็นว่าต้นข้าวห่างเกินไปให้โยนเพิ่มเติมได้ วิธีโยนสามารถนำอุปกรณ์คล้ายเรือลงไปในแปลงนาได้ เพื่อให้สามารถใส่ถาดเพาะครั้งละมาก ๆ และสะดวก ในการโยน เกษตรกร 1 คน โยนต้นกล้าได้ 3-5 ไร่/วัน หลังจากหว่าน 1-2 วัน ให้เติมน้ำทันทีและเพิ่มระดับน้ำขึ้นเรื่อย ๆ จนถึง 5-10 เซนติเมตร ซึ่งมีประสิทธิภาพควบคุมข้าววัชพืชและวัชพืชได้ดีมาก ให้รักษาระดับน้ำจนถึงข้าวโตคลุมพื้นที่นาหรือจนถึงก่อนเกี่ยว 15-20 วัน ภาพรวงข้าว โดย นางสาวสุดารัตน์ แก้วบัวดี 4.ขั้นตอนการปฏิบัติดูแลรักษา ควรใส่ปุ๋ยรองพื้นก่อนโยนต้นกล้า 1 วัน ขณะปรับเทือกและการปฏิบัติดูแลรักษาเช่นเดียวกันกับการทำนาวิธีอื่น ๆ ทุกประการ";
                        final String rice_method_three = "การปลูกข้าวนาดำ การปลูกข้าวนาดำ หมายถึง การปลูกข้าวนาสวนในสภาพพื้นที่ลุ่มน้ำขัง โดยใช้ต้นกล้าข้าวทำการ ปักดำลงไปในดินแปลงนา ซึ่งจะมีขั้นตอนของการปลูกข้าวแบ่งออกเป็น 2 ระยะ คือ ระยะต้นกล้า และระยะปักดำ โดยในแต่ระยะจะสามารถนำเครื่องจักรกลเกษตรมาใช้ ดังนี้ ระยะต้นกล้า จะมีขั้นตอน ดังนี้ 1. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 2. เปิดหน้าดิน ไถหัวหมู, ไถจาน, โรตารี 3. ย่อยดิน ขลุบ, คราด 4. ทำเทือก แผ่นปรับระดับดิน, เครื่องชักร่องน้ำ 5. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 5. หว่านเมล็ด เครื่องหว่านเมล็ด 6. หว่านปุ๋ย เครื่องหว่านปุ๋ย 7. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 8. ถอนกล้า แรงงานคน ระยะปักดำ จะมีขั้นตอน ดังนี้ 1.ทดน้ำเข้าแปลง เครื่องสูบน้ำ 2. เปิดหน้าดิน ไถหัวหมู, ไถจาน, โรตารี 3. ย่อยดิน ขลุบ, คราด 4. ปักดำ เครื่องปักดำแบบเดินตาม, เครื่องปักดำแบบนั่งขับ 5. ระบายน้ำเข้าแปลง เครื่องสูบน้ำ 6. หว่านปุ๋ย เครื่องหว่านปุ๋ยแบบสะพายหลัง, เครื่องหว่านปุ๋ยแบบติดเครื่องต้นกำลัง 7. พ่นยา เครื่องพ่นยาแบบสะพายหลัง, เครื่องพ่นยาแบบติดเครื่องต้นกำลัง 8. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 9. เก็บเกี่ยว เครื่องเก็บเกี่ยวนวด, เครื่องเกี่ยววางราย, เคียว 10. นวดข้าว เครื่องนวดข้าวแบบใช้แรงงานคน, เครื่องนวดข้าวแบบใช้เครื่องยนต์ 11. ลดความชื่นข้าวเปลือก รถเกลี่ย/รถตักข้าว, เครื่องอบลดความชื้น 12. เก็บรักษา ไซโล, ฉางข้าว 13. ขนส่ง รถอีแต๊ก, รถอีแต๋น, รถยนต์ 4-10 ล้อ";
                        //ข้อความที่จะเอาไปแสดงเก็บไว้ใน test
                        Intent intent = new Intent(AnalysisArea.this, ShowRiceCalculateActivity.class);
                        intent.putExtra("Messagerice_type", rice_type); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweather_napee", weather_napee); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweather_napung", weather_napung); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("MessageChemical_fertilizer", Chemical_fertilizer); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("MessageBio_fertilizer", Bio_fertilizer); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageadjust_soil", adjust_soil); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagesoil_type", soil_type); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweed_type", weed_type); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweed_Removal", weed_Removal); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagedayrice_napung", dayrice_napung); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagericedisease_name", ricedisease_name); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagericedisease_Removal", ricedisease_Removal); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagerice_method_one", rice_method_one); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagerice_method_two", rice_method_two); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagerice_method_three", rice_method_three); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Picture1",rice_picture[0]);
                        intent.putExtra("Picture2",rice_picture[11]);
                        intent.putExtra("Picture3",rice_picture[0]);
                        intent.putExtra("Picture4",rice_picture[17]);//ส่งรูปไป
                        startActivity(intent);
                    }else if(rice_type_layout.equals("ปทุมธานี1") && rice_aumper.equals("อำเภอคลองหลวง") && rice_tambon.equals("คลองหนึ่ง") && rice_water_area.equals("ได้รับ")){
                        final String rice_type = "ปทุมธานี1";
                        final String weather_napee = "ฤดูฝน พฤษภาคม - ตุลาคม อุณหภูมิเฉลี่ย 29.52 ปริมาณน้ำฝนเฉลี่ย 293.87";
                        final String weather_napung = "ฤดูร้อน กุมภาพันธ์ - พฤษภาคม อุณหภูมิเฉลี่ย 30.65 ปริมาณน้ำฝนเฉลี่ย 75.2";
                        final String Chemical_fertilizer = "การใส่ปุ๋ยมีควรแบ่งใส่ 2 ครั้ง ดังนี้ การใส่ปุ๋ยรั้งที่ 1 - ใช้ปุ๋ยสูตร 16-20-0 สําหรับนาดินเหนียว หากเป็นนาดินทราย ใช้สูตร 16-16-8 จํานวนไร่ละ 25-30 กิโลกรัม โดยหว่านก่อนปักดำข้าว 1 วัน หรือภายใน 10 วัน หลังจากปักดำข้าวสําหรับนาดํา ถ้าเป็นนาหว่านให้หว่านปุ๋ยหลังจากข้าวงอกแล้ว 20-25 วัน การใส่ปุ๋ยครั้งที่ 2 - ใช้ปุ๋ยสูตร 46-0-0 จํานวนไร่ละ 10 กิโลกรัม (หรือปุ๋ยสูตร 26-0-0 จํานวนไร่ละ 20 กิโลกรัม) โดยหว่านระยะข้าวรวงอ่อน คือก่อนเก็บเกี่ยว 60 วัน หรือหลังจากปักดําประมาณ 35-45 วัน สําหรับนาดํา ถ้าเป็นนาหว่านให้หว่านหลังจากหว่านปุ๋ยครั้งแรกประมาณ 35-45 วัน ปุ๋ยเคมีสูตร 9-24-24 คุณสมบัติปุ๋ยเคมีสูตร 9-24-24 เป็นปุ๋ยเคมีชนิดเม็ด ประกอบด้วยปริมาณธาตุอาหารหลัก ดังนี้ 1.ไนโตรเจนทั้งหมด(N) 9 % เร่งการเจริญเติบโต  ใส่แล้วพืชจะเขียวเข็ม  โตเร็ว   2.ฟอสเฟตที่เป็นประโยชน์(P2O5) 24 % การสร้างแป้ง-น้ำตาล  ให้ต้นพืช  เพื่อสะสมการออกดอก 3.โพแทชที่ละลายน้า(K2O) 24 %   ช่วยให้ผลผลิต  มีน้ำหนักเพิ่มขึ้น  สร้างความหวาน        ปุ๋ยเคมีสูตร 9-24-24  เป็นปุ๋ยเร่งดอกเร่งผล ทำให้ออกดอกมาก ดอกสวยงามสีสด  ผลใหญ่ รสชาดดี          วิธีใช้ ปุ๋ยสูตร 9-24-24         การใส่ปุ๋ยสูตร 9-24-24 จะทำให้พืชสร้างตาดอก ทำให้ดอกดก ดอกใหญ่ สีสวย  การใส่ปุ๋ยสูตร 9-24-24  ใส่ในอัตราส่วน   1-2 ช้อนชา / ต้น ทุก 15 วัน (พืชที่โตเต็มที่และพร้อมให้ดอกและผล)  ในพืชผักเช่น พริก หอม กระเทียม มันฝรั่ง มะเขือ ขิง ควรหว่านให้ทั่วแปลงในอัตรา 40-60 กิโลกรัมต่อไร่";
                        final String Bio_fertilizer ="1 ไถ่พรวน หว่านปุ๋ยชีวภาพ 100 ก.ก. (ต่อ 1 ไร่) ให้ทั่ว จากนั้นนำน้ำหมักชีวภาพที่ได้จากน้ำหมักพืช 2 แก้ว กากน้ำตาล 2 แก้ว ในน้ำ 200 ลิตร (1 ถังแดง) ต่อพื้นที่ 1 ไร่ ฉีดพ่นให้ทั่วแล้วไถพรวน ทิ้งไว้ 15 วัน เพื่อให้จุลินทรีย์ในน้ำหมักพืชทำการย่อยสลายวัชพืชและเร่งการงอกของเมล็ดข้าว เมื่อไถพรวนแล้ว 15 วัน ให้ฉีดพ่นน้ำผสมน้ำหมักพืช และกากน้ำตาล ในอัตราส่วนเท่าเดิมอีกครั้งหนึ่ง แล้วไถกลบเพื่อทำลายวัชพืช ให้เป็นปุ๋ยพืชสด ทิ้งไว้อีก 15 วัน แล้วจึงไถคราดเพื่อดำนาต่อไป";
                        final String soil_type = "ดินเหนียวจัด";
                        final String adjust_soil ="1. ดินกรดจัดน้อย (ชั้น P-IIa) เหมาะสมในการทำนา ความเป็นกรดของดินเป็นอุปสรรคบ้างเล็กน้อย เป็นดินเหนียว หน้าดินลึก การระบายน้ำเลว ดินบนมีค่า pHต่ำกว่า 5.5 ความอุดมสมบูรณ์ปานกลาง ข้าวมีการตอบสนองต่อปุ๋ยน้อย ได้ผลผลิตประมาณ 250-350 กิโลกรัมต่อไร่ ดินชั้นนี้มีพื้นที่ประมาณ 3,500,000 ไร่ มี ประมาณ 3 แสนไร่ หรือ ร้อยละ 60 อยู่ในภาคกลาง ได้แก่ ดินชุดอยุธยา มหาโพธิ์ อยุธยา/มหาโพธิ์ เสนา บางน้ำเปรี้ยว ฉะเชิงเทรา และ ท่าขวาง โดยดินชุดเสนา เป็นดินชุดที่มีพื้นที่มากที่สุด ประมาณ ร้อยละ 50 ของชั้น และ ร้อยละ 20 อยู่ในภาคกลาง";
                        final String weed_type = "เพลี้ยจักจั่นสีเขียว";
                        final String weed_Removal = "ลักษณะการทำลาย เพลี้ยจักจั่นสีเขียวอพยพเข้าแปลงข้าวทันทีหลังจากเป็นต้นกล้า และมีปริมาณมากที่สุดในช่วงการเจริญเติบโตทางลำต้นและใบ ตัวอ่อนและตัวเต็มวัยดูดกินน้ำเลี้ยงจากใบและลำต้นข้าว ทำให้ข้าวชะงักการเจริญเติบโตและอาจแห้งตายได้ถ้ามีปริมาณมาก และเป็นแมลงพาหะนำโรคใบสีส้ม (yellow orange leaf virus) มาสู่ข้าว ทำให้ต้นข้าวแคระแกร็น ใบเหลือง ข้าวออกรวงไม่สม่ำเสมอ เมล็ดลีบ โดยปรกติอาศัยอยู่ส่วนบนของต้นข้าวในตอนเข้า และย้ายลงมาด้านล่างของต้นข้าวในตอนบ่าย ตัวเต็มวัยและตัวอ่อนจะแพร่กระจายออกไปไม่อยู่รวมกันเป็นกลุ่ม โดยทั่วไปจึงไม่พบจำนวนประชากรมากถึงระดับทำให้ข้าวแห้งตายได้ ฤดูกาลปลูกข้าวครั้งหนึ่งเพลี้ยจักจั่นสามารถดำรงชีวิตได้ 3-4 ชั่วอายุ ตัวเต็มวัยสามารถดักจับได้จากกับดักแสงไฟ มักพบระบาดในฤดูฝนที่สภาพต้นข้าวเจริญดีเหมาะต่อการขยายพันธุ์ การป้องกันกำจัด 1. ใช้แสงไฟล่อแมลงและทำลายเมื่อมีการระบาดรุนแรง 2. ปลูกข้าวพร้อม ๆ กัน และปล่อยพื้นนาว่างไว้ระยะหนึ่ง เพื่อตัดวงจรชีวิตของแมลง 3. ปลูกข้าวพันธุ์ต้านทาน กข4 กข9 กข21 กข23 สุพรรณบุรี 60 สุพรรณบุรี 90 พิษณุโลก 2 ชุมแพ 60 เก้ารวง 88 แก่นจันทร์ นางพญา 132 พวงไร่ 4. ใช้สารฆ่าแมลงตามคำแนะนำในตารางที่ 2 เมื่อมีการระบาดของโรคใบสีส้ม";
                        final String dayrice_napung = "ประมาณ 104-126 วัน";
                        final String ricedisease_name = "1 โรคขอบใบแห้ง, 2 โรคใบสีส้ม";
                        final String ricedisease_Removal ="1 โรคขอบใบแห้ง สาเหตุ จากเชื้อแบคทีเรีย เป็นโรคที่พบเห็นในแปลงนาโดยทั่วไป มีสาเหตุจากเชื้อแบคทีเรีย ซึ่งสามารถแพร่ระบาดติดต่อไปได้รวดเร็ว โดยเฉพาะเมื่อสภาพแวดล้อมเหมาะสม เช่น มีระดับน้ำในนาสูง การระบายน้ำไม่ดี, ฝนตกพรำ, และน้ำท่วม ซึ่งความชื้นอากาศสูง เป็นสภาพที่เหมาะสมต่อการเข้าทำลายของโรคขอบใบไหม้ในข้าว กรมส่งเสริมการเกษตรเตือนให้เกษตรกร หมั่นสำรวจแปลงนาอย่างสม่ำเสมอ เนื่องจากในช่วงนี้มีฝนตกและความชื้นในอากาศสูงเหมาะกับการระบาดของโรค การป้องกันปฏิบัติตามข้อแนะนำดังนี้ :1 ใช้พันธุ์ข้าวที่ต้านทาน เช่น ในภาคกลาง 2 ไม่ควรใส่ปุ๋ยไนโตรเจนมากในดินที่อุดมสมบูรณ์อยู่แล้ว 3 ไม่ควรระบายน้ำจากแปลงที่เป็นโรคไปสู่แปลงอื่น 4 เฝ้าระวังการเกิดโรคถ้าปลูกข้าวพันธุ์ที่อ่อนแอต่อโรคนี้ 2 โรคใบสีส้ม ลักษณะอาการ ต้นข้าวเป็นโรคได้ทุกระยะการเจริญเติบโต หากได้รับเชื้อตอนข้าวอายุอ่อน (ระยะกล้า-แตกกอ) ข้าวจะเสียหายมากกว่าได้รับเชื้อ ตอนข้าวอายุแก่ (ระยะตั้งท้อง-ออกรวง) ข้าวเริ่มแสดงอาการตั้งแต่อายุ 15-20 วัน ทั้งนี้แล้วแต่ว่าข้าวจะได้รับเชื้อระยะใด อาการเริ่มต้น ใบข้าวจะเริ่มมีสีเขียวสลับเหลือง ต่อมาจะเปลี่ยนเป็นสีเหลือง เริ่มจากปลายใบเข้าหาโคนใบ ถ้าเป็นรุนแรงใน ระยะกล้าต้นข้าวอาจถึงตาย ถ้าอาการแสดงหลังปักดำ เริ่มสังเกตได้ที่ใบเช่นกัน ต้นที่เป็นโรคจะเตี้ยแคระแกรน ช่วงลำต้น จะสั้นกว่าปกติมาก ใบใหม่ที่โผล่ออกจะมีตำแหน่งต่ำกว่าข้อต่อใบของใบล่าสุด ถ้าเป็นรุนแรงอาจตายทั้งกอ ถ้าไม่ตายมีอายุ จนกระทั่งออกรวง ก็จะให้รวงเล็ก หรือไม่ออกรวงเลย และออกรวงล่าช้ากว่าปกติ การป้องกันและกำจัด 1. ใช้พันธุ์ข้าวต้านทานเพลี้ยจักจั่นสีเขียว 2. กำจัดวัชพืช และพืชอาศัยของเชื้อไวรัสและแมลงพาหะนำโรค 3. ใช้สารป้องกันกำจัดแมลงพาหะ ได้แก่ สารประเภทดูดซึม เช่น ฟูราดาน, คูราแทร์ หรือมิปซิน หรือประเภทยาฉีดพ่น เช่น เซฟวิน 85, มิปซิน, หรือยาออกฤทธิ์ปราบเพลี้ยจั๊กจั่นสีเขียวอื่น ๆ ตามคำแนะนำของนักวิชาการ ตามอัตราและระยะเวลาใช้ ที่เหมาะสม";
                        final String rice_method_one ="การหว่านน้ำตม เป็นการหว่านเมล็ดพันธุ์ข้าวในพื้นที่ที่มีน้ำหรือในเขตชลประทาน ซึ่งจะต้องมีการเตรียมพื้นที่ทำนาให้เป็นตมเสียก่อนที่จะทำการหว่านเมล็ดพันธุ์ข้าวที่เพาะให้งอกเล็กน้อยลงไป โดยมีการใช้เครื่องจักรกลเกษตรในแต่ละขั้นตอนการปลูกข้าว ดังนี้ 1. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 2. เปิดหน้าดิน ไถหัวหมู, ไถจาน, โรตารี 3. ย่อยดิน ขลุบ, คราด 4. ทำเทือก แผ่นปรับระดับดิน, เครื่องชักร่องน้ำ 5. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 6. หว่านเมล็ดข้าว เครื่องหว่านเมล็ดแบบสะพายหลัง, เครื่องหว่านเมล็ดแบบจานเหวี่ยง 7. หว่านปุ๋ย เครื่องหว่านปุ๋ยแบบสะพายหลัง, เครื่องหว่านปุ๋ยแบบติดเครื่องต้นกำลัง 8. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 9. พ่นยา เครื่องพ่นยาแบบสะพายหลัง, เครื่องพ่นยาแบบติดเครื่องต้นกำลัง 10. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 11. ลดความชื่นข้าวเปลือก รถเกลี่ย/รถตักข้าว, เครื่องอบลดความชื้น 12. เก็บเกี่ยว เครื่องเก็บเกี่ยวนวด, เครื่องเกี่ยววางราย, เคียว 13. นวดข้าว เครื่องนวดข้าวแบบใช้แรงงานคน, เครื่องนวดข้าวแบบใช้เครื่องยนต์ 14. เก็บรักษา ไซโล, ฉางข้าว 15. ขนส่ง รถอีแต๊ก, รถอีแต๋น, รถยนต์ 4-10 ล้อ";
                        final String rice_method_two ="การทำนาแบบโยนกล้ามีอยู่ 4 ขั้นตอน ดังนี้ 1.ขั้นตอนการเตรียมเพาะกล้าพันธุ์ ซึ่งเตรียมได้ 2 แบบ คือ วิธีเตรียมถาดเพาะกล้าแบบแห้ง โดยย่อยดินแห้งให้ละเอียด เม็ดดินโตไม่เกิน 0.5 ซม. ดินนั้นต้องไม่มีเมล็ดข้าววัชพืช นำถาดพลาสติกมาวางกับพื้นที่ ที่เตรียมไว้ พื้นที่ต้องเสมอกัน โดยวางเป็นแถวตอน 2-4 แผ่น (แล้วแต่ความสะดวกในการปฏิบัติงาน) หว่านดินไปก่อนประมาณ 50-70% จากนั้นหว่านเมล็ดพันธุ์บริสุทธิ์ (แช่ 1 คืน หุ้ม 1 คืน หรือข้าวแห้ง) อัตราประมาณ 3-4 กก.ต่อ 50-60 ถาด (ต่อไร่) แล้วหว่านดินตามลงไปให้เต็มเสมอปากหลุมพอดี อย่าให้ดินล้นปากหลุมเพาะ เพราะจะทำให้รากข้าวพันกันเวลาโยนต้นกล้า มันจะไม่กระจายตัว การใช้แรงงานย่อยดินแห้งและเพาะข้าว 1 คน ต่อ 150-200 ถาดต่อ 1 วัน (หว่านได้ 2-3 ไร่) การให้น้ำระยะแรก ๆ ต้องให้ฝอยละเอียด ระวังอย่าให้เมล็ดข้าว กระเด็น หรือให้น้ำแบบท่วมพื้นแปลง เพราะน้ำจะซึมเข้าก้นถาดหลุมเอง ให้รักษาความชื้นจนกว่าข้าวงอก หากมีฝนตกให้หาวัสดุหรือกระสอบป่านเก่ามาคลุมจนกว่ารากจะงอก วิธีนี้สามารถเพาะเมล็ดในร่มและย้ายถาดไปที่ที่เตรียมไว้ พอข้าวกล้าอายุ 12-16 วัน สามารถนำไปโยนได้ทันที ความยาวต้นกล้าประมาณ 3-5 นิ้ว ซึ่งก็แล้วแต่ความอุดมสมบูรณ์ของวัสดุเพาะ ใช้พื้นที่เพาะกล้าประมาณ 12-15 ตารางเมตรต่อ 50-60 ถาด หว่านได้ 1 ไร่ วิธีเพาะกล้าแบบแห้งนี้ ได้คิดค้นวิธีหยอดเมล็ดพันธุ์ที่แม่นยำ สามารถควบคุมดินและเมล็ดพันธุ์ตามต้องการได้ เป็นอุปกรณ์ต้นแบบเพื่อนำไปพัฒนาต่อยอดได้ วิธีเตรียมถาดเพาะกล้าแบบเปียก โดยเลือกแปลงนาที่ไม่มีข้าววัชพืชและวัชพืชทั่วไประบาด มีการเตรียมแปลงคล้ายกับเพาะกล้านาดำ ลูบเทือกให้ดินสม่ำเสมอ นำถาดเพาะกล้าวางเป็นแถวคู่เอาหัวชนกัน วางเป็นแถวตอนความยาวแล้วแต่แปลงกล้า แต่ละคู่แถวห่างกันประมาณ 50 ซม.เพื่อให้สะดวกในการปฏิบัติงาน โดยนำดิน เลนระหว่างร่องทางเดินใส่บานถาดให้เต็ม ปรับให้เสมอปากหลุมถาด แต่อย่าให้ดินล้นปากหลุมเพาะ เพราะจะทำให้รากข้าวพันกันเวลาหว่านต้นกล้า จากนั้นหว่านเมล็ดพันธุ์บริสุทธิ์ (โดยแช่ 1 คืน หุ้ม 1 คืน หรือข้าวแห้ง) ด้วยอัตราประมาณ 3-4 กก./50-60 ถาด (ต่อไร่) ใช้แผ่นไม้คล้ายไม้บรรทัดกดหรือลูบเมล็ดพันธุ์ให้จมเลน โดยรักษาความชื้นตลอดไป หากมีฝนตกต้องหาวัสดุมาคลุมเพื่อกันเมล็ดข้าวกระเด็นออกจากถาดเพาะ พอกล้าอายุ 12-16 วัน นำไปโยนได้ทันที หรือความยาวต้นกล้าประมาณ 3-5 นิ้ว ใช้พื้นที่เพาะกล้าประมาณ 12-15 ตารางเมตร 50-60 ถาด โดยได้ 1 ไร่ ก่อนนำไปโยนควรหยุดให้น้ำต้นกล้า 1 วัน ภาพการเตรียมแปลงนา โดย นางสาวสุดารัตน์ แก้วบัวดี 2.ขั้นตอนการเตรียมแปลง ก่อน ทำนาให้พักแปลงนาให้แห้งอย่างน้อย 1 เดือน เพื่อให้ข้าววัชพืชพ้นระยะพักตัว หรือให้เมล็ดข้าววัชพืชที่ร่วงในนาก่อนนี่พร้อมที่จะงอกให้มากที่สุด ให้ขังน้ำในแปลง 1 คืน และปล่อยให้น้ำแห้งเองเพื่อล่อข้าววัชพืชให้งอกขึ้นมาเต็มที่ซึ่งไม่ควรพ่น สารเคมีกำจัด แต่ให้ไถกลบทุบเป็นปุ๋ยไปเลย... ควรล่อวัชพืชอย่างน้อย 1 ครั้งขึ้นไป ต่อจากนั้น ให้ไถเตรียมดินเหมือนนาดำ หรือนาหว่านน้ำตมทั่วไป แต่ปรับเทือกให้สม่ำเสมอมากที่สุด พอเช้าวันต่อมาให้โยนกล้าได้กรณีที่เป็นดินเหนียว แต่ถ้าเป็นดินร่วนปนทรายหรือดินทราย หลังปรับเทือกให้โยนต้นกล้าทันทีทันใด ภาพการโยนกล้า โดย นางสาวสุดารัตน์ แก้วบัวดี 3.ขั้นตอนการโยนต้นกล้า ขณะ ที่โยนต้นกล้าในแปลงควรมีน้ำขลุกขลิกเล็กน้อย วิธีโยน ให้เดินถอยหลังโยนกำมือละ 5-15 หลุม โดยตวัดหงายมือโยนต้นข้าวขึ้นสูงกว่าระดับศีรษะ ต้นกล้าจะกระจายตัวพุ่งลงตั้งตรงหรือเอนเล็กน้อย สำหรับถาดเพาะให้วางบนท่อนแขนครั้งละหลาย ๆ แผ่นแล้วแต่จะรับไหว หากเห็นว่าต้นข้าวห่างเกินไปให้โยนเพิ่มเติมได้ วิธีโยนสามารถนำอุปกรณ์คล้ายเรือลงไปในแปลงนาได้ เพื่อให้สามารถใส่ถาดเพาะครั้งละมาก ๆ และสะดวก ในการโยน เกษตรกร 1 คน โยนต้นกล้าได้ 3-5 ไร่/วัน หลังจากหว่าน 1-2 วัน ให้เติมน้ำทันทีและเพิ่มระดับน้ำขึ้นเรื่อย ๆ จนถึง 5-10 เซนติเมตร ซึ่งมีประสิทธิภาพควบคุมข้าววัชพืชและวัชพืชได้ดีมาก ให้รักษาระดับน้ำจนถึงข้าวโตคลุมพื้นที่นาหรือจนถึงก่อนเกี่ยว 15-20 วัน ภาพรวงข้าว โดย นางสาวสุดารัตน์ แก้วบัวดี 4.ขั้นตอนการปฏิบัติดูแลรักษา ควรใส่ปุ๋ยรองพื้นก่อนโยนต้นกล้า 1 วัน ขณะปรับเทือกและการปฏิบัติดูแลรักษาเช่นเดียวกันกับการทำนาวิธีอื่น ๆ ทุกประการ";
                        final String rice_method_three = "การปลูกข้าวนาดำ การปลูกข้าวนาดำ หมายถึง การปลูกข้าวนาสวนในสภาพพื้นที่ลุ่มน้ำขัง โดยใช้ต้นกล้าข้าวทำการ ปักดำลงไปในดินแปลงนา ซึ่งจะมีขั้นตอนของการปลูกข้าวแบ่งออกเป็น 2 ระยะ คือ ระยะต้นกล้า และระยะปักดำ โดยในแต่ระยะจะสามารถนำเครื่องจักรกลเกษตรมาใช้ ดังนี้ ระยะต้นกล้า จะมีขั้นตอน ดังนี้ 1. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 2. เปิดหน้าดิน ไถหัวหมู, ไถจาน, โรตารี 3. ย่อยดิน ขลุบ, คราด 4. ทำเทือก แผ่นปรับระดับดิน, เครื่องชักร่องน้ำ 5. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 5. หว่านเมล็ด เครื่องหว่านเมล็ด 6. หว่านปุ๋ย เครื่องหว่านปุ๋ย 7. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 8. ถอนกล้า แรงงานคน ระยะปักดำ จะมีขั้นตอน ดังนี้ 1.ทดน้ำเข้าแปลง เครื่องสูบน้ำ 2. เปิดหน้าดิน ไถหัวหมู, ไถจาน, โรตารี 3. ย่อยดิน ขลุบ, คราด 4. ปักดำ เครื่องปักดำแบบเดินตาม, เครื่องปักดำแบบนั่งขับ 5. ระบายน้ำเข้าแปลง เครื่องสูบน้ำ 6. หว่านปุ๋ย เครื่องหว่านปุ๋ยแบบสะพายหลัง, เครื่องหว่านปุ๋ยแบบติดเครื่องต้นกำลัง 7. พ่นยา เครื่องพ่นยาแบบสะพายหลัง, เครื่องพ่นยาแบบติดเครื่องต้นกำลัง 8. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 9. เก็บเกี่ยว เครื่องเก็บเกี่ยวนวด, เครื่องเกี่ยววางราย, เคียว 10. นวดข้าว เครื่องนวดข้าวแบบใช้แรงงานคน, เครื่องนวดข้าวแบบใช้เครื่องยนต์ 11. ลดความชื่นข้าวเปลือก รถเกลี่ย/รถตักข้าว, เครื่องอบลดความชื้น 12. เก็บรักษา ไซโล, ฉางข้าว 13. ขนส่ง รถอีแต๊ก, รถอีแต๋น, รถยนต์ 4-10 ล้อ";
                                //ข้อความที่จะเอาไปแสดงเก็บไว้ใน test
                        Intent intent = new Intent(AnalysisArea.this, ShowRiceCalculateActivity.class);
                        intent.putExtra("Messagerice_type", rice_type); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweather_napee", weather_napee); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweather_napung", weather_napung); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("MessageChemical_fertilizer", Chemical_fertilizer); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("MessageBio_fertilizer", Bio_fertilizer); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageadjust_soil", adjust_soil); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagesoil_type", soil_type); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweed_type", weed_type); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweed_Removal", weed_Removal); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagedayrice_napung", dayrice_napung); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagericedisease_name", ricedisease_name); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagericedisease_Removal", ricedisease_Removal); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagerice_method_one", rice_method_one); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagerice_method_two", rice_method_two); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagerice_method_three", rice_method_three); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Picture1",rice_picture[1]);
                        intent.putExtra("Picture2",rice_picture[11]);//ส่งรูปไป
                        intent.putExtra("Picture3",rice_picture[10]);//ส่งรูปไป
                        intent.putExtra("Picture4",rice_picture[21]);//ส่งรูปไป// ส่งรูปไป
                        startActivity(intent);

                    }else if(rice_type_layout.equals("สุพรรณบุรี 1") && rice_aumper.equals("อำเภอคลองหลวง") && rice_tambon.equals("คลองหนึ่ง") && rice_water_area.equals("ได้รับ")){
                        final String rice_type = "สุพรรณบุรี 1";
                        final String weather_napee = "ฤดูฝน พฤษภาคม - ตุลาคม อุณหภูมิเฉลี่ย 29.52 ปริมาณน้ำฝนเฉลี่ย 293.87";
                        final String weather_napung = "ฤดูร้อน กุมภาพันธ์ - พฤษภาคม อุณหภูมิเฉลี่ย 30.65 ปริมาณน้ำฝนเฉลี่ย 75.2";
                        final String Chemical_fertilizer ="การใส่ปุ๋ยมีควรแบ่งใส่ 2 ครั้ง ดังนี้ การใส่ปุ๋ยรั้งที่ 1 - ใช้ปุ๋ยสูตร 16-20-0 สําหรับนาดินเหนียว หากเป็นนาดินทราย ใช้สูตร 16-16-8 จํานวนไร่ละ 25-30 กิโลกรัม โดยหว่านก่อนปักดำข้าว 1 วัน หรือภายใน 10 วัน หลังจากปักดำข้าวสําหรับนาดํา ถ้าเป็นนาหว่านให้หว่านปุ๋ยหลังจากข้าวงอกแล้ว 20-25 วัน การใส่ปุ๋ยครั้งที่ 2 - ใช้ปุ๋ยสูตร 46-0-0 จํานวนไร่ละ 10 กิโลกรัม (หรือปุ๋ยสูตร 26-0-0 จํานวนไร่ละ 20 กิโลกรัม) โดยหว่านระยะข้าวรวงอ่อน คือก่อนเก็บเกี่ยว 60 วัน หรือหลังจากปักดําประมาณ 35-45 วัน สําหรับนาดํา ถ้าเป็นนาหว่านให้หว่านหลังจากหว่านปุ๋ยครั้งแรกประมาณ 35-45 วัน ปุ๋ยเคมีสูตร 9-24-24 คุณสมบัติปุ๋ยเคมีสูตร 9-24-24 เป็นปุ๋ยเคมีชนิดเม็ด ประกอบด้วยปริมาณธาตุอาหารหลัก ดังนี้ 1.ไนโตรเจนทั้งหมด(N) 9 % เร่งการเจริญเติบโต  ใส่แล้วพืชจะเขียวเข็ม  โตเร็ว   2.ฟอสเฟตที่เป็นประโยชน์(P2O5) 24 % การสร้างแป้ง-น้ำตาล  ให้ต้นพืช  เพื่อสะสมการออกดอก 3.โพแทชที่ละลายน้า(K2O) 24 %   ช่วยให้ผลผลิต  มีน้ำหนักเพิ่มขึ้น  สร้างความหวาน        ปุ๋ยเคมีสูตร 9-24-24  เป็นปุ๋ยเร่งดอกเร่งผล ทำให้ออกดอกมาก ดอกสวยงามสีสด  ผลใหญ่ รสชาดดี          วิธีใช้ ปุ๋ยสูตร 9-24-24         การใส่ปุ๋ยสูตร 9-24-24 จะทำให้พืชสร้างตาดอก ทำให้ดอกดก ดอกใหญ่ สีสวย  การใส่ปุ๋ยสูตร 9-24-24  ใส่ในอัตราส่วน   1-2 ช้อนชา / ต้น ทุก 15 วัน (พืชที่โตเต็มที่และพร้อมให้ดอกและผล)  ในพืชผักเช่น พริก หอม กระเทียม มันฝรั่ง มะเขือ ขิง ควรหว่านให้ทั่วแปลงในอัตรา 40-60 กิโลกรัมต่อไร่";
                        final String Bio_fertilizer ="ไถ่พรวน หว่านปุ๋ยชีวภาพ 100 ก.ก. (ต่อ 1 ไร่) ให้ทั่ว จากนั้นนำน้ำหมักชีวภาพที่ได้จากน้ำหมักพืช 2 แก้ว กากน้ำตาล 2 แก้ว ในน้ำ 200 ลิตร (1 ถังแดง) ต่อพื้นที่ 1 ไร่ ฉีดพ่นให้ทั่วแล้วไถพรวน ทิ้งไว้ 15 วัน เพื่อให้จุลินทรีย์ในน้ำหมักพืชทำการย่อยสลายวัชพืชและเร่งการงอกของเมล็ดข้าว เมื่อไถพรวนแล้ว 15 วัน ให้ฉีดพ่นน้ำผสมน้ำหมักพืช และกากน้ำตาล ในอัตราส่วนเท่าเดิมอีกครั้งหนึ่ง แล้วไถกลบเพื่อทำลายวัชพืช ให้เป็นปุ๋ยพืชสด ทิ้งไว้อีก 15 วัน แล้วจึงไถคราดเพื่อดำนาต่อไป";
                        final String soil_type = "ดินเหนียวจัด";
                        final String adjust_soil ="1. ดินกรดจัดน้อย (ชั้น P-IIa) เหมาะสมในการทำนา ความเป็นกรดของดินเป็นอุปสรรคบ้างเล็กน้อย เป็นดินเหนียว หน้าดินลึก การระบายน้ำเลว ดินบนมีค่า pHต่ำกว่า 5.5 ความอุดมสมบูรณ์ปานกลาง ข้าวมีการตอบสนองต่อปุ๋ยน้อย ได้ผลผลิตประมาณ 250-350 กิโลกรัมต่อไร่ ดินชั้นนี้มีพื้นที่ประมาณ 3,500,000 ไร่ มี ประมาณ 3 แสนไร่ หรือ ร้อยละ 60 อยู่ในภาคกลาง ได้แก่ ดินชุดอยุธยา มหาโพธิ์ อยุธยา/มหาโพธิ์ เสนา บางน้ำเปรี้ยว ฉะเชิงเทรา และ ท่าขวาง โดยดินชุดเสนา เป็นดินชุดที่มีพื้นที่มากที่สุด ประมาณ ร้อยละ 50 ของชั้น และ ร้อยละ 20 อยู่ในภาคกลาง";
                        final String weed_type = "1 โรคใบขีดสีน้ำตาล อาการ ลักษณะแผลที่ใบมีสีน้ำตาลเป็นขีด ๆ ขนานไปกับเส้นใบข้าว มักพบในระยะข้าวแตกกอ แผลไม่กว้าง ตรงกลางเล็กและไม่มีรอยช้ำที่แผล ต่อมาแผลจะขยายมาติดกัน แผลจะมีมากตามใบล่างและปลายใบ ใบที่เป็นโรคจะแห้งตายจากปลายใบก่อน ต้นข้าวที่เป็นโรครุนแรงจะมีแผลสีน้ำตาลที่ข้อต่อใบได้เช่นกัน เชื้อนี้สามารถเข้าทำลายคอรวง ทำให้คอรวงเน่าและหักพับได้ การป้องกันกำจัด ใช้ปุ๋ยโปแตสเซียมคลอไรด์ (0-0-60) อัตรา 5-10 กิโลกรัมต่อไร่ สามารถช่วยลดความรุนแรงของโรคได้ ถ้าพบโรคระบาดของโรครุนแรงในระยะแตกกอ ให้ฉีดพ่นด้วยสารป้องกันกำจัดเชื้อรา เช่น คาร์เบ็นดาซิม เนื่องจากเชื้อสาเหตุทำให้เกิดโรคเมล็ดด่าง 2 โรคเมล็ดด่าง ลักษณะอาการ เมล็ดลีบเป็นบางส่วน บนเมล็ดเต็มส่วนใหญ่จะมีแผลเป็นจุดสีน้ำตาล-ดำ บางส่วนก็มีลายสีน้ำตาล และบางพวกมีสีเทา หรือสีปนชมพู ทั้งนี้ เพราะมีเชื้อราหลายชนิดที่สามารถเข้าทำลายและทำให้เกิดอาการแตกต่างกันไป การเข้าทำลายของเชื้อรา มักจะเกิดในช่วงที่ ดอกข้าวผสมแล้วอยู่ในช่วงเป็นน้ำนมและกำลังจะสุก หลังจากนั้นประมาณเกือบเดือน (ใกล้เก็บเกี่ยว) อาการเมล็ดด่างจะปรากฏ เด่นชัด โรคนี้สามารถแพร่กระจายไปกับลม และติดไปกับเมล็ด และอาจทำให้เชื้อราแพร่กระจายในยุ้งฉางได้ การป้องกันและกำจัด 1. หลีกเลี่ยงพันธุ์ข้าวที่อ่อนแอต่อโรคนี้ 2. ใช้เมล็ดพันธุ์จากแปลงที่ไม่เป็นโรค 3. คลุกเมล็ดพันธุ์ด้วยสารป้องกันกำจัดเชื้อรา เช่น คาร์เบนดาซิม แมนโคเซบ ในอัตรา 3 กรัมต่อเมล็ดพันธุ์ 1 กิโลกรัม 4. ในระยะที่ข้าวกำลังจะให้รวง หรือให้รวงเป็นเมล็ดแล้ว ถ้ามีฝนตกชุก ควรวางมาตรการป้องกันแต่ต้นมือ โดยใช้ยาเคมี อาทิเช่น โพลีอ๊อกซิน, ซีสเทน, ฮีโนซาน หรือเดลซีน ฉีดพ่นตามคำแนะนำของนักวิชาการ ";
                        final String weed_Removal =" ";
                        final String dayrice_napung = "ประมาณ 120 วัน";
                        final String ricedisease_name = "1 โรคใบขีดสีน้ำตาล, 2 โรคเมล็ดด่าง";
                        final String ricedisease_Removal ="1 โรคใบขีดสีน้ำตาล อาการ ลักษณะแผลที่ใบมีสีน้ำตาลเป็นขีด ๆ ขนานไปกับเส้นใบข้าว มักพบในระยะข้าวแตกกอ แผลไม่กว้าง ตรงกลางเล็กและไม่มีรอยช้ำที่แผล ต่อมาแผลจะขยายมาติดกัน แผลจะมีมากตามใบล่างและปลายใบ ใบที่เป็นโรคจะแห้งตายจากปลายใบก่อน ต้นข้าวที่เป็นโรครุนแรงจะมีแผลสีน้ำตาลที่ข้อต่อใบได้เช่นกัน เชื้อนี้สามารถเข้าทำลายคอรวง ทำให้คอรวงเน่าและหักพับได้ การป้องกันกำจัด ใช้ปุ๋ยโปแตสเซียมคลอไรด์ (0-0-60) อัตรา 5-10 กิโลกรัมต่อไร่ สามารถช่วยลดความรุนแรงของโรคได้ ถ้าพบโรคระบาดของโรครุนแรงในระยะแตกกอ ให้ฉีดพ่นด้วยสารป้องกันกำจัดเชื้อรา เช่น คาร์เบ็นดาซิม เนื่องจากเชื้อสาเหตุทำให้เกิดโรคเมล็ดด่าง 2 โรคเมล็ดด่าง ลักษณะอาการ เมล็ดลีบเป็นบางส่วน บนเมล็ดเต็มส่วนใหญ่จะมีแผลเป็นจุดสีน้ำตาล-ดำ บางส่วนก็มีลายสีน้ำตาล และบางพวกมีสีเทา หรือสีปนชมพู ทั้งนี้ เพราะมีเชื้อราหลายชนิดที่สามารถเข้าทำลายและทำให้เกิดอาการแตกต่างกันไป การเข้าทำลายของเชื้อรา มักจะเกิดในช่วงที่ ดอกข้าวผสมแล้วอยู่ในช่วงเป็นน้ำนมและกำลังจะสุก หลังจากนั้นประมาณเกือบเดือน (ใกล้เก็บเกี่ยว) อาการเมล็ดด่างจะปรากฏ เด่นชัด โรคนี้สามารถแพร่กระจายไปกับลม และติดไปกับเมล็ด และอาจทำให้เชื้อราแพร่กระจายในยุ้งฉางได้ การป้องกันและกำจัด 1. หลีกเลี่ยงพันธุ์ข้าวที่อ่อนแอต่อโรคนี้ 2. ใช้เมล็ดพันธุ์จากแปลงที่ไม่เป็นโรค 3. คลุกเมล็ดพันธุ์ด้วยสารป้องกันกำจัดเชื้อรา เช่น คาร์เบนดาซิม แมนโคเซบ ในอัตรา 3 กรัมต่อเมล็ดพันธุ์ 1 กิโลกรัม 4. ในระยะที่ข้าวกำลังจะให้รวง หรือให้รวงเป็นเมล็ดแล้ว ถ้ามีฝนตกชุก ควรวางมาตรการป้องกันแต่ต้นมือ โดยใช้ยาเคมี อาทิเช่น โพลีอ๊อกซิน, ซีสเทน, ฮีโนซาน หรือเดลซีน ฉีดพ่นตามคำแนะนำของนักวิชาการ";
                        final String rice_method_one ="การหว่านน้ำตม เป็นการหว่านเมล็ดพันธุ์ข้าวในพื้นที่ที่มีน้ำหรือในเขตชลประทาน ซึ่งจะต้องมีการเตรียมพื้นที่ทำนาให้เป็นตมเสียก่อนที่จะทำการหว่านเมล็ดพันธุ์ข้าวที่เพาะให้งอกเล็กน้อยลงไป โดยมีการใช้เครื่องจักรกลเกษตรในแต่ละขั้นตอนการปลูกข้าว ดังนี้ 1. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 2. เปิดหน้าดิน ไถหัวหมู, ไถจาน, โรตารี 3. ย่อยดิน ขลุบ, คราด 4. ทำเทือก แผ่นปรับระดับดิน, เครื่องชักร่องน้ำ 5. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 6. หว่านเมล็ดข้าว เครื่องหว่านเมล็ดแบบสะพายหลัง, เครื่องหว่านเมล็ดแบบจานเหวี่ยง 7. หว่านปุ๋ย เครื่องหว่านปุ๋ยแบบสะพายหลัง, เครื่องหว่านปุ๋ยแบบติดเครื่องต้นกำลัง 8. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 9. พ่นยา เครื่องพ่นยาแบบสะพายหลัง, เครื่องพ่นยาแบบติดเครื่องต้นกำลัง 10. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 11. ลดความชื่นข้าวเปลือก รถเกลี่ย/รถตักข้าว, เครื่องอบลดความชื้น 12. เก็บเกี่ยว เครื่องเก็บเกี่ยวนวด, เครื่องเกี่ยววางราย, เคียว 13. นวดข้าว เครื่องนวดข้าวแบบใช้แรงงานคน, เครื่องนวดข้าวแบบใช้เครื่องยนต์ 14. เก็บรักษา ไซโล, ฉางข้าว 15. ขนส่ง รถอีแต๊ก, รถอีแต๋น, รถยนต์ 4-10 ล้อ";
                        final String rice_method_two ="การทำนาแบบโยนกล้ามีอยู่ 4 ขั้นตอน ดังนี้ 1.ขั้นตอนการเตรียมเพาะกล้าพันธุ์ ซึ่งเตรียมได้ 2 แบบ คือ วิธีเตรียมถาดเพาะกล้าแบบแห้ง โดยย่อยดินแห้งให้ละเอียด เม็ดดินโตไม่เกิน 0.5 ซม. ดินนั้นต้องไม่มีเมล็ดข้าววัชพืช นำถาดพลาสติกมาวางกับพื้นที่ ที่เตรียมไว้ พื้นที่ต้องเสมอกัน โดยวางเป็นแถวตอน 2-4 แผ่น (แล้วแต่ความสะดวกในการปฏิบัติงาน) หว่านดินไปก่อนประมาณ 50-70% จากนั้นหว่านเมล็ดพันธุ์บริสุทธิ์ (แช่ 1 คืน หุ้ม 1 คืน หรือข้าวแห้ง) อัตราประมาณ 3-4 กก.ต่อ 50-60 ถาด (ต่อไร่) แล้วหว่านดินตามลงไปให้เต็มเสมอปากหลุมพอดี อย่าให้ดินล้นปากหลุมเพาะ เพราะจะทำให้รากข้าวพันกันเวลาโยนต้นกล้า มันจะไม่กระจายตัว การใช้แรงงานย่อยดินแห้งและเพาะข้าว 1 คน ต่อ 150-200 ถาดต่อ 1 วัน (หว่านได้ 2-3 ไร่) การให้น้ำระยะแรก ๆ ต้องให้ฝอยละเอียด ระวังอย่าให้เมล็ดข้าว กระเด็น หรือให้น้ำแบบท่วมพื้นแปลง เพราะน้ำจะซึมเข้าก้นถาดหลุมเอง ให้รักษาความชื้นจนกว่าข้าวงอก หากมีฝนตกให้หาวัสดุหรือกระสอบป่านเก่ามาคลุมจนกว่ารากจะงอก วิธีนี้สามารถเพาะเมล็ดในร่มและย้ายถาดไปที่ที่เตรียมไว้ พอข้าวกล้าอายุ 12-16 วัน สามารถนำไปโยนได้ทันที ความยาวต้นกล้าประมาณ 3-5 นิ้ว ซึ่งก็แล้วแต่ความอุดมสมบูรณ์ของวัสดุเพาะ ใช้พื้นที่เพาะกล้าประมาณ 12-15 ตารางเมตรต่อ 50-60 ถาด หว่านได้ 1 ไร่ วิธีเพาะกล้าแบบแห้งนี้ ได้คิดค้นวิธีหยอดเมล็ดพันธุ์ที่แม่นยำ สามารถควบคุมดินและเมล็ดพันธุ์ตามต้องการได้ เป็นอุปกรณ์ต้นแบบเพื่อนำไปพัฒนาต่อยอดได้ วิธีเตรียมถาดเพาะกล้าแบบเปียก โดยเลือกแปลงนาที่ไม่มีข้าววัชพืชและวัชพืชทั่วไประบาด มีการเตรียมแปลงคล้ายกับเพาะกล้านาดำ ลูบเทือกให้ดินสม่ำเสมอ นำถาดเพาะกล้าวางเป็นแถวคู่เอาหัวชนกัน วางเป็นแถวตอนความยาวแล้วแต่แปลงกล้า แต่ละคู่แถวห่างกันประมาณ 50 ซม.เพื่อให้สะดวกในการปฏิบัติงาน โดยนำดิน เลนระหว่างร่องทางเดินใส่บานถาดให้เต็ม ปรับให้เสมอปากหลุมถาด แต่อย่าให้ดินล้นปากหลุมเพาะ เพราะจะทำให้รากข้าวพันกันเวลาหว่านต้นกล้า จากนั้นหว่านเมล็ดพันธุ์บริสุทธิ์ (โดยแช่ 1 คืน หุ้ม 1 คืน หรือข้าวแห้ง) ด้วยอัตราประมาณ 3-4 กก./50-60 ถาด (ต่อไร่) ใช้แผ่นไม้คล้ายไม้บรรทัดกดหรือลูบเมล็ดพันธุ์ให้จมเลน โดยรักษาความชื้นตลอดไป หากมีฝนตกต้องหาวัสดุมาคลุมเพื่อกันเมล็ดข้าวกระเด็นออกจากถาดเพาะ พอกล้าอายุ 12-16 วัน นำไปโยนได้ทันที หรือความยาวต้นกล้าประมาณ 3-5 นิ้ว ใช้พื้นที่เพาะกล้าประมาณ 12-15 ตารางเมตร 50-60 ถาด โดยได้ 1 ไร่ ก่อนนำไปโยนควรหยุดให้น้ำต้นกล้า 1 วัน ภาพการเตรียมแปลงนา โดย นางสาวสุดารัตน์ แก้วบัวดี 2.ขั้นตอนการเตรียมแปลง ก่อน ทำนาให้พักแปลงนาให้แห้งอย่างน้อย 1 เดือน เพื่อให้ข้าววัชพืชพ้นระยะพักตัว หรือให้เมล็ดข้าววัชพืชที่ร่วงในนาก่อนนี่พร้อมที่จะงอกให้มากที่สุด ให้ขังน้ำในแปลง 1 คืน และปล่อยให้น้ำแห้งเองเพื่อล่อข้าววัชพืชให้งอกขึ้นมาเต็มที่ซึ่งไม่ควรพ่น สารเคมีกำจัด แต่ให้ไถกลบทุบเป็นปุ๋ยไปเลย... ควรล่อวัชพืชอย่างน้อย 1 ครั้งขึ้นไป ต่อจากนั้น ให้ไถเตรียมดินเหมือนนาดำ หรือนาหว่านน้ำตมทั่วไป แต่ปรับเทือกให้สม่ำเสมอมากที่สุด พอเช้าวันต่อมาให้โยนกล้าได้กรณีที่เป็นดินเหนียว แต่ถ้าเป็นดินร่วนปนทรายหรือดินทราย หลังปรับเทือกให้โยนต้นกล้าทันทีทันใด ภาพการโยนกล้า โดย นางสาวสุดารัตน์ แก้วบัวดี 3.ขั้นตอนการโยนต้นกล้า ขณะ ที่โยนต้นกล้าในแปลงควรมีน้ำขลุกขลิกเล็กน้อย วิธีโยน ให้เดินถอยหลังโยนกำมือละ 5-15 หลุม โดยตวัดหงายมือโยนต้นข้าวขึ้นสูงกว่าระดับศีรษะ ต้นกล้าจะกระจายตัวพุ่งลงตั้งตรงหรือเอนเล็กน้อย สำหรับถาดเพาะให้วางบนท่อนแขนครั้งละหลาย ๆ แผ่นแล้วแต่จะรับไหว หากเห็นว่าต้นข้าวห่างเกินไปให้โยนเพิ่มเติมได้ วิธีโยนสามารถนำอุปกรณ์คล้ายเรือลงไปในแปลงนาได้ เพื่อให้สามารถใส่ถาดเพาะครั้งละมาก ๆ และสะดวก ในการโยน เกษตรกร 1 คน โยนต้นกล้าได้ 3-5 ไร่/วัน หลังจากหว่าน 1-2 วัน ให้เติมน้ำทันทีและเพิ่มระดับน้ำขึ้นเรื่อย ๆ จนถึง 5-10 เซนติเมตร ซึ่งมีประสิทธิภาพควบคุมข้าววัชพืชและวัชพืชได้ดีมาก ให้รักษาระดับน้ำจนถึงข้าวโตคลุมพื้นที่นาหรือจนถึงก่อนเกี่ยว 15-20 วัน ภาพรวงข้าว โดย นางสาวสุดารัตน์ แก้วบัวดี 4.ขั้นตอนการปฏิบัติดูแลรักษา ควรใส่ปุ๋ยรองพื้นก่อนโยนต้นกล้า 1 วัน ขณะปรับเทือกและการปฏิบัติดูแลรักษาเช่นเดียวกันกับการทำนาวิธีอื่น ๆ ทุกประการ";
                        final String rice_method_three ="การปลูกข้าวนาดำ การปลูกข้าวนาดำ หมายถึง การปลูกข้าวนาสวนในสภาพพื้นที่ลุ่มน้ำขัง โดยใช้ต้นกล้าข้าวทำการ ปักดำลงไปในดินแปลงนา ซึ่งจะมีขั้นตอนของการปลูกข้าวแบ่งออกเป็น 2 ระยะ คือ ระยะต้นกล้า และระยะปักดำ โดยในแต่ระยะจะสามารถนำเครื่องจักรกลเกษตรมาใช้ ดังนี้ ระยะต้นกล้า จะมีขั้นตอน ดังนี้ 1. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 2. เปิดหน้าดิน ไถหัวหมู, ไถจาน, โรตารี 3. ย่อยดิน ขลุบ, คราด 4. ทำเทือก แผ่นปรับระดับดิน, เครื่องชักร่องน้ำ 5. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 5. หว่านเมล็ด เครื่องหว่านเมล็ด 6. หว่านปุ๋ย เครื่องหว่านปุ๋ย 7. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 8. ถอนกล้า แรงงานคน ระยะปักดำ จะมีขั้นตอน ดังนี้ 1.ทดน้ำเข้าแปลง เครื่องสูบน้ำ 2. เปิดหน้าดิน ไถหัวหมู, ไถจาน, โรตารี 3. ย่อยดิน ขลุบ, คราด 4. ปักดำ เครื่องปักดำแบบเดินตาม, เครื่องปักดำแบบนั่งขับ 5. ระบายน้ำเข้าแปลง เครื่องสูบน้ำ 6. หว่านปุ๋ย เครื่องหว่านปุ๋ยแบบสะพายหลัง, เครื่องหว่านปุ๋ยแบบติดเครื่องต้นกำลัง 7. พ่นยา เครื่องพ่นยาแบบสะพายหลัง, เครื่องพ่นยาแบบติดเครื่องต้นกำลัง 8. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 9. เก็บเกี่ยว เครื่องเก็บเกี่ยวนวด, เครื่องเกี่ยววางราย, เคียว 10. นวดข้าว เครื่องนวดข้าวแบบใช้แรงงานคน, เครื่องนวดข้าวแบบใช้เครื่องยนต์ 11. ลดความชื่นข้าวเปลือก รถเกลี่ย/รถตักข้าว, เครื่องอบลดความชื้น 12. เก็บรักษา ไซโล, ฉางข้าว 13. ขนส่ง รถอีแต๊ก, รถอีแต๋น, รถยนต์ 4-10 ล้อ";
                        //ข้อความที่จะเอาไปแสดงเก็บไว้ใน test
                        Intent intent = new Intent(AnalysisArea.this, ShowRiceCalculateActivity.class);
                        intent.putExtra("Messagerice_type", rice_type); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweather_napee", weather_napee); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweather_napung", weather_napung); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("MessageChemical_fertilizer", Chemical_fertilizer); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("MessageBio_fertilizer", Bio_fertilizer); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageadjust_soil", adjust_soil); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagesoil_type", soil_type); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweed_type", weed_type); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweed_Removal", weed_Removal); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagedayrice_napung", dayrice_napung); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagericedisease_name", ricedisease_name); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagericedisease_Removal", ricedisease_Removal); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagerice_method_one", rice_method_one); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagerice_method_two", rice_method_two); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagerice_method_three", rice_method_three); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Picture1",rice_picture[2]);
                        intent.putExtra("Picture2",rice_picture[12]);//ส่งรูปไป
                        intent.putExtra("Picture3",rice_picture[10]);//ส่งรูปไป
                        intent.putExtra("Picture4",rice_picture[16]);//ส่งรูปไป// ส่งรูปไป
                        startActivity(intent);

                    }else if(rice_type_layout.equals("กข11") && rice_aumper.equals("อำเภอคลองหลวง") && rice_tambon.equals("คลองห้า") && rice_water_area.equals("ได้รับ")){
                        final String rice_type = "ข้าวหนัก";
                        final String weather_napee = "ฤดูฝน พฤษภาคม - ตุลาคม อุณหภูมิเฉลี่ย 29.52 ปริมาณน้ำฝนเฉลี่ย 293.87";
                        final String weather_napung = "ฤดูร้อน กุมภาพันธ์ - พฤษภาคม อุณหภูมิเฉลี่ย 30.65 ปริมาณน้ำฝนเฉลี่ย 75.2";
                        final String Chemical_fertilizer ="การใส่ปุ๋ยมีควรแบ่งใส่ 2 ครั้ง ดังนี้ การใส่ปุ๋ยรั้งที่ 1 - ใช้ปุ๋ยสูตร 16-20-0 สําหรับนาดินเหนียว หากเป็นนาดินทราย ใช้สูตร 16-16-8 จํานวนไร่ละ 25-30 กิโลกรัม โดยหว่านก่อนปักดำข้าว 1 วัน หรือภายใน 10 วัน หลังจากปักดำข้าวสําหรับนาดํา ถ้าเป็นนาหว่านให้หว่านปุ๋ยหลังจากข้าวงอกแล้ว 20-25 วัน การใส่ปุ๋ยครั้งที่ 2 - ใช้ปุ๋ยสูตร 46-0-0 จํานวนไร่ละ 10 กิโลกรัม (หรือปุ๋ยสูตร 26-0-0 จํานวนไร่ละ 20 กิโลกรัม) โดยหว่านระยะข้าวรวงอ่อน คือก่อนเก็บเกี่ยว 60 วัน หรือหลังจากปักดําประมาณ 35-45 วัน สําหรับนาดํา ถ้าเป็นนาหว่านให้หว่านหลังจากหว่านปุ๋ยครั้งแรกประมาณ 35-45 วัน ปุ๋ยเคมีสูตร 9-24-24 คุณสมบัติปุ๋ยเคมีสูตร 9-24-24 เป็นปุ๋ยเคมีชนิดเม็ด ประกอบด้วยปริมาณธาตุอาหารหลัก ดังนี้ 1.ไนโตรเจนทั้งหมด(N) 9 % เร่งการเจริญเติบโต  ใส่แล้วพืชจะเขียวเข็ม  โตเร็ว   2.ฟอสเฟตที่เป็นประโยชน์(P2O5) 24 % การสร้างแป้ง-น้ำตาล  ให้ต้นพืช  เพื่อสะสมการออกดอก 3.โพแทชที่ละลายน้า(K2O) 24 %   ช่วยให้ผลผลิต  มีน้ำหนักเพิ่มขึ้น  สร้างความหวาน        ปุ๋ยเคมีสูตร 9-24-24  เป็นปุ๋ยเร่งดอกเร่งผล ทำให้ออกดอกมาก ดอกสวยงามสีสด  ผลใหญ่ รสชาดดี          วิธีใช้ ปุ๋ยสูตร 9-24-24         การใส่ปุ๋ยสูตร 9-24-24 จะทำให้พืชสร้างตาดอก ทำให้ดอกดก ดอกใหญ่ สีสวย  การใส่ปุ๋ยสูตร 9-24-24  ใส่ในอัตราส่วน   1-2 ช้อนชา / ต้น ทุก 15 วัน (พืชที่โตเต็มที่และพร้อมให้ดอกและผล)  ในพืชผักเช่น พริก หอม กระเทียม มันฝรั่ง มะเขือ ขิง ควรหว่านให้ทั่วแปลงในอัตรา 40-60 กิโลกรัมต่อไร่";
                        final String Bio_fertilizer =" เลือกใช้ปุ๋ยคอกที่มีคุณภาพดี  โดยพิจารณาจากชนิดของมูลสัตว์  อาหารที่สัตว์กิน  อายุของสัตว์และวิธีการเก็บรักษา  เช่น  มูลไก่จะมีธาตุอาหารพืชมากกว่ามูลสุกร  สัตว์ที่กินต้นถั่วและอาหารสำเร็จรูปจะมีธาตุอาหารพืชมากกว่าสัตว์ที่กินฟางข้าวกับหญ้าแห้ง  และสัตว์ที่มีอายุมากจะให้มูลที่มีธาตุอาหารพืชมากกว่าสัตว์อายุน้อย  ส่วนวิธีการเก็บรักษาปุ๋ยคอกนั้นต้องไม่ตากแดดตากฝน  และต้องเติมปุ๋ยซูปเปอร์ฟอสเฟตลงในกองปุ๋ยคอกด้วย  เพื่อลดการสูญเสียธาตุไนโตรเจนในรูปของก๊าซแอมโมเนีย       เลือกใช้ปุ๋ยหมักที่สลายตัวสมบูรณ์แล้ว  ปุ๋ยหมักที่ได้จากการหมักเอง หรือปุ๋ยหมักที่มีจำหน่าย ถ้าเป็นชนิดผง  ต้องเป็นผงค่อนข้างละเอียด  มีกลิ่นหอมคล้ายดิน  ส่วนปุ๋ยหมักชนิดอัดเม็ดและชนิดน้ำต้องพิจารณาจากแหล่งผลิตที่เชื่อถือได้        การใช้ปุ๋ยคอก  ปุ๋ยหมักและปุ๋ยพืชสด  ควรใช้ในการเตรียมดินปลูกพืชหรือผสมดินปลูก  ยกเว้นปุ๋ยหมักอัดเม็ดและปุ๋ยหมักน้ำ  สามารถนำไปใช้ได้ดีเมื่อพืชเจริญเติบโตแล้ว  ส่วนปุ๋ยคอกที่นำมาใช้นั้น  ควรตากแดดให้แห้งสนิทและเป็นปุ๋ยคอกเก่า เพื่อป้องกันการแพร่พันธุ์ของวัชพืชที่สัตว์กินเข้าไป";
                        final String soil_type = "ดินเหนียวจัด";
                        final String adjust_soil ="ดินกรดจัดน้อย (ชั้น P-IIa) เหมาะสมในการทำนา ความเป็นกรดของดินเป็นอุปสรรคบ้างเล็กน้อย เป็นดินเหนียว หน้าดินลึก การระบายน้ำเลว ดินบนมีค่า pHต่ำกว่า 5.5 ความอุดมสมบูรณ์ปานกลาง ข้าวมีการตอบสนองต่อปุ๋ยน้อย ได้ผลผลิตประมาณ 250-350 กิโลกรัมต่อไร่ ดินชั้นนี้มีพื้นที่ประมาณ 3,500,000 ไร่ มี ประมาณ 3 แสนไร่ หรือ ร้อยละ 60 อยู่ในภาคกลาง ได้แก่ ดินชุดอยุธยา มหาโพธิ์ อยุธยา/มหาโพธิ์ เสนา บางน้ำเปรี้ยว ฉะเชิงเทรา และ ท่าขวาง โดยดินชุดเสนา เป็นดินชุดที่มีพื้นที่มากที่สุด ประมาณ ร้อยละ 50 ของชั้น และ ร้อยละ 20 อยู่ในภาคกลาง";
                        final String weed_type = "1. เพลี้ยกระโดดสีน้ำตาล, 2. เพลี้ยจักจั่นสีเขียว";
                        final String weed_Removal ="1. เพลี้ยกระโดดสีน้ำตาล ลักษณะการทำลายและการระบาด เพลี้ยกระโดดสีน้ำตาลทั้งตัวอ่อนและตัวเต็มวัย ทำลายข้าวโดยการดูดกินน้ำเลี้ยงจากเซลส์ท่อน้ำท่ออาหาร บริเวณโคนต้นข้าวระดับเหนือผิวน้ำ ทำให้ต้นข้าวมีอาการใบเหลืองแห้งลักษณะคล้ายถูกน้ำร้อนลวกแห้งตายเป็นหย่อมๆ เรียก\"อาการไหม้\"(hopperburn) โดยทั่วไปพบอาการไหม้ในระยะข้าวแตกกอถึงระยะออกรวงซึ่ง ตรงกับช่วงอายุขัยที่ 2 - 3(generation) ของเพลี้ยกระโดดสีน้ำตาลในนาข้าวนาข้าวที่ขาดน้ำ ตัวอ่อนจะลงมาอยู่ที่บริเวณโคนกอข้าวหรือบนพื้นดินที่แฉะมีความชื้น นอกจากนี้เพลี้ยกระโดดสีน้ำตาลยังเป็นพาหะนำเชื้อไวรัส โรคใบหงิก(rice raggedstunt)มาสู่ต้นข้าว ทำให้ต้นข้าวมีอาการแคระแกร็นต้นเตี้ยใบสีเขียวแคบและสั้นใบแก่ช้ากว่าปรกติ ปลายใบบิด เป็นเกลียว และ ขอบใบแหว่งวิ่น การบริหารจัดการเพลี้ยกระโดดสีน้ำตาล 1) ปลูกข้าวพันธุ์ค่อนข้างต้านทานเพลี้ยกระโดดสีน้ำตาล เช่น สุพรรณบุรี 1 สุพรรณบุรี 2 สุพรรณบุรี 90 สุพรรณบุรี 60 ปทุมธานี 1 พิษณุโลก 2 ชัยนาท 1 ชัยนาท 2 กข29 และ กข31 และไม่ควรปลูกพันธุ์เดียวติดต่อกันเกิน4ฤดูปลูก ควรปลูกสลับกันระหว่างพันธุ์ต้านทานสูงกับพันธุ์ทนทานหรือพันธุ์อ่อนแอ ปานกลาง โดยพิจารณาอายุเก็บเกี่ยวให้ใกล้เคียงกัน เพื่อลดความเสียหายเมื่อเกิดการระบาดรุนแรง 2) ในแหล่งที่มีการระบาด และควบคุมระดับน้ำในนาได้ หลังปักดำหรือหว่าน 2-3 สัปดาห์จนถึงระยะตั้งท้องควบคุมน้ำในแปลงนาให้พอดินเปียก หรือมีน้ำเรี่ยผิวดินนาน 7-10 วัน แล้วปล่อยขังทิ้งไว้ให้แห้งเองสลับกันไป จะช่วยลดการระบาดของเพลี้ยกระโดดสีน้ำตาล 3) เมื่อตรวจพบสัดส่วนของเพลี้ยกระโดดสีน้ำตาลตัวเต็มวัยต่อมวนเขียวดูดไข่ ระหว่าง 6 :1- 8 :1 หรือตัวอ่อนวัยที่ 1-2 เมื่อข้าวอายุ 30-45 วัน จำนวนมากกว่า 10 ตัวต่อต้นให้ใช้สารฆ่าแมลง บูโพรเฟซิน (แอปพลอด 10% ดับบลิวพี) อัตรา 25 กรัมต่อน้ำ 20 ลิตร หรือใช้สาร อีโทเฟนพรอกซ์(ทรีบอน 10% อีซี) อัตรา 20 มิลลิลิตรต่อน้ำ 20 ลิตร หรือ บูโพรเฟซิน/ไอโซโพรคาร์บ (แอปพลอด/มิพซิน 5%/20% ดับบลิวพี) อัตรา 50 กรัมต่อน้ำ 20 ลิตร เมื่อพบแมลงส่วนใหญ่เป็นตัวเต็มวัย จำนวนมากกว่า 1 ตัวต่อ 1 ต้นและไม่พบหรือพบมวนเขียวดูดไข่น้อยมาก ให้ใช้สารอีโทเฟนพรอกซ์ (ทรีบอน 10% อีซี) อัตรา 20 มิลลิลิตรต่อน้ำ 20 ลิตร หรือสารคาร์โบซัลแฟน (พอสซ์ 20% อีซี)อัตรา 110 มิลลิลิตรต่อน้ำ 20 ลิตร หรือไอโซโพรคาร์บ (มิพซิน 50% ดับบลิวพี) อัตรา 60 กรัมต่อน้ำ 20 ลิตร หรือสารฟีโนบูคาร์บ (บีพีเอ็มซี 50% อีซี) อัตรา 60 มิลลิลิตรต่อน้ำ 20 ลิตร ในระยะข้าว ตั้งท้องถึงออกรวง เมื่อพบเพลี้ยกระโดดสีน้ำตาล 10 ตัวต่อกอ หรือ 1 ตัวต่อ 1 ต้น และพบมวนเขียวดูดไข่จำนวนน้อยมากให้ใช้สารไทอะมิโทแซม (แอคทารา 25% ดับบลิวพี) อัตรา 2 กรัมต่อน้ำ 20 ลิตร หรือสารไดโนทีฟูเรน (สตาร์เกิล 10% ดับบลิวพี) อัตรา 15 กรัมต่อน้ำ 20 ลิตร หรือโคลไทอะนิดิน (เด็นท๊อช 16% เอสจี) อัตรา 6-9 กรัมต่อน้ำ 20 ลิตร หรืออิทิโพรล (เคอร์บิกซ์ 10% เอสซี) อัตรา 40 มิลลิลิตรต่อน้ำ 20 ลิตร หรือสารคาร์โบซัลแฟน (พอสซ์ 20% อีซี) อัตรา 110 มิลลิลิตรต่อน้ำ 20 ลิตร 4) ไม่ควรใช้สารฆ่าแมลงที่ทำให้เกิดการเพิ่มระบาดของเพลี้ยกระโดดสีน้ำตาล (resurgence) หรือสารกลุ่มไพรีทรอยด์สังเคราะห์ เช่น แอลฟาไซเพอร์เมทริน ไซเพอร์เมทริน ไซแฮโลทริน เดคาเมทริน เอสเฟนแวเลอเรต เพอร์เมทริน ไตรอะโซฟอส ไซยาโนเฟนฟอส ไอโซซาไทออน ไฟริดาเฟนไทออน ควินาลฟอส และเตตระคลอร์วินฟอส เป็นต้น 2. เพลี้ยจักจั่นสีเขียว ลักษณะการทำลาย เพลี้ยจักจั่นสีเขียวอพยพเข้าแปลงข้าวทันทีหลังจากเป็นต้นกล้า และมีปริมาณมากที่สุดในช่วงการเจริญเติบโตทางลำต้นและใบ ตัวอ่อนและตัวเต็มวัยดูดกินน้ำเลี้ยงจากใบและลำต้นข้าว ทำให้ข้าวชะงักการเจริญเติบโตและอาจแห้งตายได้ถ้ามีปริมาณมาก และเป็นแมลงพาหะนำโรคใบสีส้ม (yellow orange leaf virus) มาสู่ข้าว ทำให้ต้นข้าวแคระแกร็น ใบเหลือง ข้าวออกรวงไม่สม่ำเสมอ เมล็ดลีบ โดยปรกติอาศัยอยู่ส่วนบนของต้นข้าวในตอนเข้า และย้ายลงมาด้านล่างของต้นข้าวในตอนบ่าย ตัวเต็มวัยและตัวอ่อนจะแพร่กระจายออกไปไม่อยู่รวมกันเป็นกลุ่ม โดยทั่วไปจึงไม่พบจำนวนประชากรมากถึงระดับทำให้ข้าวแห้งตายได้ ฤดูกาลปลูกข้าวครั้งหนึ่งเพลี้ยจักจั่นสามารถดำรงชีวิตได้ 3-4 ชั่วอายุ ตัวเต็มวัยสามารถดักจับได้จากกับดักแสงไฟ มักพบระบาดในฤดูฝนที่สภาพต้นข้าวเจริญดีเหมาะต่อการขยายพันธุ์ การป้องกันกำจัด 1). ใช้แสงไฟล่อแมลงและทำลายเมื่อมีการระบาดรุนแรง 2). ปลูกข้าวพร้อม ๆ กัน และปล่อยพื้นนาว่างไว้ระยะหนึ่ง เพื่อตัดวงจรชีวิตของแมลง 3). ปลูกข้าวพันธุ์ต้านทาน กข4 กข9 กข21 กข23 สุพรรณบุรี 60 สุพรรณบุรี 90 พิษณุโลก 2 ชุมแพ 60 เก้ารวง 88 แก่นจันทร์ นางพญา 132 พวงไร่ 4). ใช้สารฆ่าแมลงตามคำแนะนำในตารางที่ 2 เมื่อมีการระบาดของโรคใบสีส้ม";
                        final String dayrice_napung = "ประมาณ 135 วัน";
                        final String ricedisease_name = "1 โรคขอบใบแห้ง, 2 โรคใบสีส้ม";
                        final String ricedisease_Removal ="1 โรคขอบใบแห้ง สาเหตุ จากเชื้อแบคทีเรีย เป็นโรคที่พบเห็นในแปลงนาโดยทั่วไป มีสาเหตุจากเชื้อแบคทีเรีย ซึ่งสามารถแพร่ระบาดติดต่อไปได้รวดเร็ว โดยเฉพาะเมื่อสภาพแวดล้อมเหมาะสม เช่น มีระดับน้ำในนาสูง การระบายน้ำไม่ดี, ฝนตกพรำ, และน้ำท่วม ซึ่งความชื้นอากาศสูง เป็นสภาพที่เหมาะสมต่อการเข้าทำลายของโรคขอบใบไหม้ในข้าว กรมส่งเสริมการเกษตรเตือนให้เกษตรกร หมั่นสำรวจแปลงนาอย่างสม่ำเสมอ เนื่องจากในช่วงนี้มีฝนตกและความชื้นในอากาศสูงเหมาะกับการระบาดของโรค การป้องกันปฏิบัติตามข้อแนะนำดังนี้ :1 ใช้พันธุ์ข้าวที่ต้านทาน เช่น ในภาคกลาง 2 ไม่ควรใส่ปุ๋ยไนโตรเจนมากในดินที่อุดมสมบูรณ์อยู่แล้ว 3 ไม่ควรระบายน้ำจากแปลงที่เป็นโรคไปสู่แปลงอื่น 4 เฝ้าระวังการเกิดโรคถ้าปลูกข้าวพันธุ์ที่อ่อนแอต่อโรคนี้ 2 โรคใบสีส้ม ลักษณะอาการ ต้นข้าวเป็นโรคได้ทุกระยะการเจริญเติบโต หากได้รับเชื้อตอนข้าวอายุอ่อน (ระยะกล้า-แตกกอ) ข้าวจะเสียหายมากกว่าได้รับเชื้อ ตอนข้าวอายุแก่ (ระยะตั้งท้อง-ออกรวง) ข้าวเริ่มแสดงอาการตั้งแต่อายุ 15-20 วัน ทั้งนี้แล้วแต่ว่าข้าวจะได้รับเชื้อระยะใด อาการเริ่มต้น ใบข้าวจะเริ่มมีสีเขียวสลับเหลือง ต่อมาจะเปลี่ยนเป็นสีเหลือง เริ่มจากปลายใบเข้าหาโคนใบ ถ้าเป็นรุนแรงใน ระยะกล้าต้นข้าวอาจถึงตาย ถ้าอาการแสดงหลังปักดำ เริ่มสังเกตได้ที่ใบเช่นกัน ต้นที่เป็นโรคจะเตี้ยแคระแกรน ช่วงลำต้น จะสั้นกว่าปกติมาก ใบใหม่ที่โผล่ออกจะมีตำแหน่งต่ำกว่าข้อต่อใบของใบล่าสุด ถ้าเป็นรุนแรงอาจตายทั้งกอ ถ้าไม่ตายมีอายุ จนกระทั่งออกรวง ก็จะให้รวงเล็ก หรือไม่ออกรวงเลย และออกรวงล่าช้ากว่าปกติ การป้องกันและกำจัด 1. ใช้พันธุ์ข้าวต้านทานเพลี้ยจักจั่นสีเขียว 2. กำจัดวัชพืช และพืชอาศัยของเชื้อไวรัสและแมลงพาหะนำโรค 3. ใช้สารป้องกันกำจัดแมลงพาหะ ได้แก่ สารประเภทดูดซึม เช่น ฟูราดาน, คูราแทร์ หรือมิปซิน หรือประเภทยาฉีดพ่น เช่น เซฟวิน 85, มิปซิน, หรือยาออกฤทธิ์ปราบเพลี้ยจั๊กจั่นสีเขียวอื่น ๆ ตามคำแนะนำของนักวิชาการ ตามอัตราและระยะเวลาใช้ ที่เหมาะสม";
                        final String rice_method_one ="การหว่านน้ำตม เป็นการหว่านเมล็ดพันธุ์ข้าวในพื้นที่ที่มีน้ำหรือในเขตชลประทาน ซึ่งจะต้องมีการเตรียมพื้นที่ทำนาให้เป็นตมเสียก่อนที่จะทำการหว่านเมล็ดพันธุ์ข้าวที่เพาะให้งอกเล็กน้อยลงไป โดยมีการใช้เครื่องจักรกลเกษตรในแต่ละขั้นตอนการปลูกข้าว ดังนี้ 1. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 2. เปิดหน้าดิน ไถหัวหมู, ไถจาน, โรตารี 3. ย่อยดิน ขลุบ, คราด 4. ทำเทือก แผ่นปรับระดับดิน, เครื่องชักร่องน้ำ 5. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 6. หว่านเมล็ดข้าว เครื่องหว่านเมล็ดแบบสะพายหลัง, เครื่องหว่านเมล็ดแบบจานเหวี่ยง 7. หว่านปุ๋ย เครื่องหว่านปุ๋ยแบบสะพายหลัง, เครื่องหว่านปุ๋ยแบบติดเครื่องต้นกำลัง 8. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 9. พ่นยา เครื่องพ่นยาแบบสะพายหลัง, เครื่องพ่นยาแบบติดเครื่องต้นกำลัง 10. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 11. ลดความชื่นข้าวเปลือก รถเกลี่ย/รถตักข้าว, เครื่องอบลดความชื้น 12. เก็บเกี่ยว เครื่องเก็บเกี่ยวนวด, เครื่องเกี่ยววางราย, เคียว 13. นวดข้าว เครื่องนวดข้าวแบบใช้แรงงานคน, เครื่องนวดข้าวแบบใช้เครื่องยนต์ 14. เก็บรักษา ไซโล, ฉางข้าว 15. ขนส่ง รถอีแต๊ก, รถอีแต๋น, รถยนต์ 4-10 ล้อ";
                        final String rice_method_two ="การทำนาแบบโยนกล้ามีอยู่ 4 ขั้นตอน ดังนี้ 1.ขั้นตอนการเตรียมเพาะกล้าพันธุ์ ซึ่งเตรียมได้ 2 แบบ คือ วิธีเตรียมถาดเพาะกล้าแบบแห้ง โดยย่อยดินแห้งให้ละเอียด เม็ดดินโตไม่เกิน 0.5 ซม. ดินนั้นต้องไม่มีเมล็ดข้าววัชพืช นำถาดพลาสติกมาวางกับพื้นที่ ที่เตรียมไว้ พื้นที่ต้องเสมอกัน โดยวางเป็นแถวตอน 2-4 แผ่น (แล้วแต่ความสะดวกในการปฏิบัติงาน) หว่านดินไปก่อนประมาณ 50-70% จากนั้นหว่านเมล็ดพันธุ์บริสุทธิ์ (แช่ 1 คืน หุ้ม 1 คืน หรือข้าวแห้ง) อัตราประมาณ 3-4 กก.ต่อ 50-60 ถาด (ต่อไร่) แล้วหว่านดินตามลงไปให้เต็มเสมอปากหลุมพอดี อย่าให้ดินล้นปากหลุมเพาะ เพราะจะทำให้รากข้าวพันกันเวลาโยนต้นกล้า มันจะไม่กระจายตัว การใช้แรงงานย่อยดินแห้งและเพาะข้าว 1 คน ต่อ 150-200 ถาดต่อ 1 วัน (หว่านได้ 2-3 ไร่) การให้น้ำระยะแรก ๆ ต้องให้ฝอยละเอียด ระวังอย่าให้เมล็ดข้าว กระเด็น หรือให้น้ำแบบท่วมพื้นแปลง เพราะน้ำจะซึมเข้าก้นถาดหลุมเอง ให้รักษาความชื้นจนกว่าข้าวงอก หากมีฝนตกให้หาวัสดุหรือกระสอบป่านเก่ามาคลุมจนกว่ารากจะงอก วิธีนี้สามารถเพาะเมล็ดในร่มและย้ายถาดไปที่ที่เตรียมไว้ พอข้าวกล้าอายุ 12-16 วัน สามารถนำไปโยนได้ทันที ความยาวต้นกล้าประมาณ 3-5 นิ้ว ซึ่งก็แล้วแต่ความอุดมสมบูรณ์ของวัสดุเพาะ ใช้พื้นที่เพาะกล้าประมาณ 12-15 ตารางเมตรต่อ 50-60 ถาด หว่านได้ 1 ไร่ วิธีเพาะกล้าแบบแห้งนี้ ได้คิดค้นวิธีหยอดเมล็ดพันธุ์ที่แม่นยำ สามารถควบคุมดินและเมล็ดพันธุ์ตามต้องการได้ เป็นอุปกรณ์ต้นแบบเพื่อนำไปพัฒนาต่อยอดได้ วิธีเตรียมถาดเพาะกล้าแบบเปียก โดยเลือกแปลงนาที่ไม่มีข้าววัชพืชและวัชพืชทั่วไประบาด มีการเตรียมแปลงคล้ายกับเพาะกล้านาดำ ลูบเทือกให้ดินสม่ำเสมอ นำถาดเพาะกล้าวางเป็นแถวคู่เอาหัวชนกัน วางเป็นแถวตอนความยาวแล้วแต่แปลงกล้า แต่ละคู่แถวห่างกันประมาณ 50 ซม.เพื่อให้สะดวกในการปฏิบัติงาน โดยนำดิน เลนระหว่างร่องทางเดินใส่บานถาดให้เต็ม ปรับให้เสมอปากหลุมถาด แต่อย่าให้ดินล้นปากหลุมเพาะ เพราะจะทำให้รากข้าวพันกันเวลาหว่านต้นกล้า จากนั้นหว่านเมล็ดพันธุ์บริสุทธิ์ (โดยแช่ 1 คืน หุ้ม 1 คืน หรือข้าวแห้ง) ด้วยอัตราประมาณ 3-4 กก./50-60 ถาด (ต่อไร่) ใช้แผ่นไม้คล้ายไม้บรรทัดกดหรือลูบเมล็ดพันธุ์ให้จมเลน โดยรักษาความชื้นตลอดไป หากมีฝนตกต้องหาวัสดุมาคลุมเพื่อกันเมล็ดข้าวกระเด็นออกจากถาดเพาะ พอกล้าอายุ 12-16 วัน นำไปโยนได้ทันที หรือความยาวต้นกล้าประมาณ 3-5 นิ้ว ใช้พื้นที่เพาะกล้าประมาณ 12-15 ตารางเมตร 50-60 ถาด โดยได้ 1 ไร่ ก่อนนำไปโยนควรหยุดให้น้ำต้นกล้า 1 วัน ภาพการเตรียมแปลงนา 2.ขั้นตอนการเตรียมแปลง ก่อน ทำนาให้พักแปลงนาให้แห้งอย่างน้อย 1 เดือน เพื่อให้ข้าววัชพืชพ้นระยะพักตัว หรือให้เมล็ดข้าววัชพืชที่ร่วงในนาก่อนนี่พร้อมที่จะงอกให้มากที่สุด ให้ขังน้ำในแปลง 1 คืน และปล่อยให้น้ำแห้งเองเพื่อล่อข้าววัชพืชให้งอกขึ้นมาเต็มที่ซึ่งไม่ควรพ่น สารเคมีกำจัด แต่ให้ไถกลบทุบเป็นปุ๋ยไปเลย... ควรล่อวัชพืชอย่างน้อย 1 ครั้งขึ้นไป ต่อจากนั้น ให้ไถเตรียมดินเหมือนนาดำ หรือนาหว่านน้ำตมทั่วไป แต่ปรับเทือกให้สม่ำเสมอมากที่สุด พอเช้าวันต่อมาให้โยนกล้าได้กรณีที่เป็นดินเหนียว แต่ถ้าเป็นดินร่วนปนทรายหรือดินทราย หลังปรับเทือกให้โยนต้นกล้าทันทีทันใด ภาพการโยนกล้า 3.ขั้นตอนการโยนต้นกล้า ขณะ ที่โยนต้นกล้าในแปลงควรมีน้ำขลุกขลิกเล็กน้อย วิธีโยน ให้เดินถอยหลังโยนกำมือละ 5-15 หลุม โดยตวัดหงายมือโยนต้นข้าวขึ้นสูงกว่าระดับศีรษะ ต้นกล้าจะกระจายตัวพุ่งลงตั้งตรงหรือเอนเล็กน้อย สำหรับถาดเพาะให้วางบนท่อนแขนครั้งละหลาย ๆ แผ่นแล้วแต่จะรับไหว หากเห็นว่าต้นข้าวห่างเกินไปให้โยนเพิ่มเติมได้ วิธีโยนสามารถนำอุปกรณ์คล้ายเรือลงไปในแปลงนาได้ เพื่อให้สามารถใส่ถาดเพาะครั้งละมาก ๆ และสะดวก ในการโยน เกษตรกร 1 คน โยนต้นกล้าได้ 3-5 ไร่/วัน หลังจากหว่าน 1-2 วัน ให้เติมน้ำทันทีและเพิ่มระดับน้ำขึ้นเรื่อย ๆ จนถึง 5-10 เซนติเมตร ซึ่งมีประสิทธิภาพควบคุมข้าววัชพืชและวัชพืชได้ดีมาก ให้รักษาระดับน้ำจนถึงข้าวโตคลุมพื้นที่นาหรือจนถึงก่อนเกี่ยว 15-20 วันภาพรวงข้าว 4.ขั้นตอนการปฏิบัติดูแลรักษา ควรใส่ปุ๋ยรองพื้นก่อนโยนต้นกล้า 1 วัน ขณะปรับเทือกและการปฏิบัติดูแลรักษาเช่นเดียวกันกับการทำนาวิธีอื่น ๆ ทุกประการ";
                        final String rice_method_three ="การปลูกข้าวนาดำ การปลูกข้าวนาดำ หมายถึง การปลูกข้าวนาสวนในสภาพพื้นที่ลุ่มน้ำขัง โดยใช้ต้นกล้าข้าวทำการ ปักดำลงไปในดินแปลงนา ซึ่งจะมีขั้นตอนของการปลูกข้าวแบ่งออกเป็น 2 ระยะ คือ ระยะต้นกล้า และระยะปักดำ โดยในแต่ระยะจะสามารถนำเครื่องจักรกลเกษตรมาใช้ ดังนี้ ระยะต้นกล้า จะมีขั้นตอน ดังนี้ 1. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 2. เปิดหน้าดิน ไถหัวหมู, ไถจาน, โรตารี 3. ย่อยดิน ขลุบ, คราด 4. ทำเทือก แผ่นปรับระดับดิน, เครื่องชักร่องน้ำ 5. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 5. หว่านเมล็ด เครื่องหว่านเมล็ด 6. หว่านปุ๋ย เครื่องหว่านปุ๋ย 7. ทดน้ำเข้าแปลง เครื่องสูบน้ำ 8. ถอนกล้า แรงงานคน ระยะปักดำ จะมีขั้นตอน ดังนี้ 1.ทดน้ำเข้าแปลง เครื่องสูบน้ำ 2. เปิดหน้าดิน ไถหัวหมู, ไถจาน, โรตารี 3. ย่อยดิน ขลุบ, คราด 4. ปักดำ เครื่องปักดำแบบเดินตาม, เครื่องปักดำแบบนั่งขับ 5. ระบายน้ำเข้าแปลง เครื่องสูบน้ำ 6. หว่านปุ๋ย เครื่องหว่านปุ๋ยแบบสะพายหลัง, เครื่องหว่านปุ๋ยแบบติดเครื่องต้นกำลัง 7. พ่นยา เครื่องพ่นยาแบบสะพายหลัง, เครื่องพ่นยาแบบติดเครื่องต้นกำลัง 8. ระบายน้ำออกจากแปลง เครื่องสูบน้ำ 9. เก็บเกี่ยว เครื่องเก็บเกี่ยวนวด, เครื่องเกี่ยววางราย, เคียว 10. นวดข้าว เครื่องนวดข้าวแบบใช้แรงงานคน, เครื่องนวดข้าวแบบใช้เครื่องยนต์ 11. ลดความชื่นข้าวเปลือก รถเกลี่ย/รถตักข้าว, เครื่องอบลดความชื้น 12. เก็บรักษา ไซโล, ฉางข้าว 13. ขนส่ง รถอีแต๊ก, รถอีแต๋น, รถยนต์ 4-10 ล้อ";                        //ข้อความที่จะเอาไปแสดงเก็บไว้ใน test
                        Intent intent = new Intent(AnalysisArea.this, ShowRiceCalculateActivity.class);
                        intent.putExtra("Messagerice_type", rice_type); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweather_napee", weather_napee); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweather_napung", weather_napung); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("MessageChemical_fertilizer", Chemical_fertilizer); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("MessageBio_fertilizer", Bio_fertilizer); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageadjust_soil", adjust_soil); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagesoil_type", soil_type); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweed_type", weed_type); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messageweed_Removal", weed_Removal); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagedayrice_napung", dayrice_napung); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagericedisease_name", ricedisease_name); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagericedisease_Removal", ricedisease_Removal); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagerice_method_one", rice_method_one); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagerice_method_two", rice_method_two); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Messagerice_method_three", rice_method_three); //รับค่า test มาเก็บไว้ใน masssage
                        intent.putExtra("Picture1",rice_picture[8]);
                        intent.putExtra("Picture2",rice_picture[13]);//ส่งรูปไป
                        intent.putExtra("Picture3",rice_picture[10]);//ส่งรูปไป
                        intent.putExtra("Picture4",rice_picture[24]);//ส่งรูปไป// ส่งรูปไป
                        startActivity(intent);
                    }
//กรณี error
                }else {
                    //จะให้ทำอะไร
                }

            }
        });



    }

//    private class GetContacts extends AsyncTask<Void, Void, Void> {
//
//        @Override
//        protected void onPreExecute() {
//            super.onPreExecute();
//            // Showing progress dialog
//            pDialog = new ProgressDialog(AnalysisArea.this);
//            pDialog.setMessage("Please wait...");
//            pDialog.setCancelable(false);
//            pDialog.show();
//
//        }
//
//        @Override
//        protected Void doInBackground(Void... arg0) {
//            HttpHandler sh = new HttpHandler();
//
//            // Making a request to url and getting response
//            String jsonStr = sh.makeServiceCall(url);
//
//            Log.d(TAG, "Response from url: " + jsonStr);
//
//            if (jsonStr != null) {
//                try {
//
//                    JSONArray mJsonArray = new JSONArray(jsonStr);
//
//                    // looping through All Contacts
//                    for (int i = 0; i < mJsonArray.length(); i++) {
//                        JSONObject c = mJsonArray.getJSONObject(i);
//
//                        String analy1_id = c.getString("analy1_id");
//                        String rice = c.getString("rice");
//                        String rice_type = c.getString("rice_type");
//                        String weather_napee = c.getString("weather_napee");
//                        String weather_napung = c.getString("weather_napung");
//                        String district = c.getString("district");
//                        String tambon = c.getString("tambon");
//                        String rice_area = c.getString("rice_area");
//                        String water_area = c.getString("water_area");
//                        String chemical_fertilizer = c.getString("chemical_fertilizer");
//                        String bio_fertilizer = c.getString("bio_fertilizer");
//                        String soil_type = c.getString("soil_type");
//                        String adjust_soil = c.getString("adjust_soil");
//                        String weed_type = c.getString("weed_type");
//                        String weed_Removal = c.getString("weed_Removal");
//                        String dayrice_napee = c.getString("dayrice_napee");
//                        String dayrice_napung = c.getString("dayrice_napung");
//                        String ricedisease_name = c.getString("ricedisease_name");
//                        String ricedisease_Removal = c.getString("ricedisease_Removal");
//                        String rice_method_one = c.getString("rice_method_one");
//                        String rice_method_two = c.getString("rice_method_two");
//                        String rice_method_three = c.getString("rice_method_three");
//                        String rice_img = c.getString("rice_img");
//                        String weed_img = c.getString("weed_img");
//                        String soil_img = c.getString("soil_img");
//                        String fer_img = c.getString("fer_img");
//
//                        // adding contact to contact list
//                        contactList.add(new Analysis(analy1_id, rice, rice_type, weather_napee, weather_napung, district, tambon, rice_area, water_area, chemical_fertilizer, bio_fertilizer, soil_type
//                                , adjust_soil, weed_type, weed_Removal, dayrice_napee, dayrice_napung, ricedisease_name, ricedisease_Removal, rice_method_one, rice_method_two, rice_method_three,
//                                weed_img, rice_img, soil_img, fer_img));
//
//
//                    }
//                } catch (final JSONException e) {
//                    Log.e(TAG, "Json parsing error: " + e.getMessage());
//                    runOnUiThread(new Runnable() {
//                        @Override
//                        public void run() {
//                            Toast.makeText(getApplicationContext(),
//                                    "Json parsing error: " + e.getMessage(),
//                                    Toast.LENGTH_LONG)
//                                    .show();
//                        }
//                    });
//
//                }
//            } else {
//                Log.e(TAG, "Couldn't get json from server.");
//                runOnUiThread(new Runnable() {
//                    @Override
//                    public void run() {
//                        Toast.makeText(getApplicationContext(),
//                                "Couldn't get json from server. Check LogCat for possible errors!",
//                                Toast.LENGTH_LONG)
//                                .show();
//                    }
//                });
//
//            }
//
//            return null;
//        }
//
//        @Override
//        protected void onPostExecute(Void result) {
//            super.onPostExecute(result);
//            // Dismiss the progress dialog
//            if (pDialog.isShowing())
//                pDialog.dismiss();
//            /**
//             * Updating parsed JSON data into ListView
//             * */
//
////                    AnalysisAdapter analysisAdapter = new AnalysisAdapter(AnalysisArea.this,contactList);
////                    lv.setAdapter(analysisAdapter);
////                    lv.setLayoutManager(new LinearLayoutManager(AnalysisArea.this,LinearLayoutManager.VERTICAL,false));
//        }
//
//    }

}